{"title": "SZA shares emotional journey in India, praises Isha Foundation and Indian kids", "detail_url": "https://tribune.com.pk/story/2525005/sza-shares-emotional-journey-in-india-praises-isha-foundation-and-indian-kids", "image_urls": ["https://i.tribune.com.pk/media/images/sza1717126588-0/sza1717126588-0.jpg"], "catagory": "Pop Culture & Art", "content": "Grammy-winning artist SZA recently visited India to participate in a spiritual program at the Isha Foundation, led by Sadhguru. Known for her hit songs ‘Kill Bill’ and ‘All the Stars,’ the singer spent weeks at the foundation, engaging in the Samyama program, which she later described as a deeply transformative experience. In her Instagram posts, SZA shared that the program required complete disconnection—no phone, mirrors, or even eye contact—for over eight days. “Life is so profound and chaotic and beautiful. I have no words for my Samyama experience,” she wrote. Upon returning to her daily life, SZA expressed gratitude for the clarity and peace she gained, despite feeling initially overwhelmed. She thanked Sadhguru, the Isha volunteers, and the staff for their care, concluding her post with “Namaskaram.” Among the most emotional moments of her visit was a performance by children from Sadhguru Gurukulam Samskriti, a residential school emphasizing yoga, martial arts, music, dance, and academics. SZA shared a video of the children’s performance, describing it as “insane” and admitting it brought her to tears. “I’ve never seen such vibrant discipline,” she wrote, expressing her admiration for their talent and dedication. The performance left such an impact on SZA that she plans to incorporate the children’s audio into her music. “I’ve already sent it to my production team,” she revealed, showcasing how the experience has inspired her creatively. SZA concluded by thanking Radhe Jaggi, Sadhguru’s daughter, and the foundation’s team for an unforgettable experience. Her posts highlight the profound effect her time in India had on both her personal outlook and artistic vision, underscoring the transformative power of spiritual connection.   COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/sza1717126588-0/sza1717126588-0.jpg", "path": "full/dd2780a7d7cde5a1430a275b6c45278f565ebe55.jpg", "checksum": "3ad7387db1330a1b0ef1f2405c36c035", "status": "downloaded"}]},
{"title": "Dr. Seuss' 'Oh, the Places You'll Go!' set for 2028 IMAX release from 'Wicked' director Jon M. Chu", "detail_url": "https://tribune.com.pk/story/2525011/dr-seuss-oh-the-places-youll-go-set-for-2028-imax-release-from-wicked-director-jon-m-chu", "image_urls": ["https://i.tribune.com.pk/media/images/fizza-2025-01-28t122736-8331738049207-0/fizza-2025-01-28t122736-8331738049207-0.png"], "catagory": "Pop Culture & Art", "content": "The film will follow a young adventurer navigating the unpredictable highs and lows of life, staying true to the beloved themes of Seuss’ 1990 classic. The movie boasts an impressive creative team. The screenplay is written by Rob Lieber ( ), with original songs crafted by EGOT winners Benj Pasek and Justin Paul ( ). Legendary producer J.J. Abrams and Gregg Taylor are attached as producers under the banner of Dr. Seuss Enterprises and Bad Robot. Jon M. Chu is coming off the success of Universal’s  , which earned 10 Oscar nominations. Although Chu was snubbed for the Best Director category,  is set to release its second installment in November and Chu is already juggling multiple high-profile projects, including Amazon Studios’ adaptation of J . Chu has been attached to   since 2021, with Jill Culton joining as co-director in 2024. The movie joins Warner Bros.’ growing slate of Dr. Seuss adaptations. Upcoming projects include in 2026, featuring Bill Hader as the mischievous feline, and a standalone animated feature about      COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/fizza-2025-01-28t122736-8331738049207-0/fizza-2025-01-28t122736-8331738049207-0.png", "path": "full/a5a0b40d6d2be7cd41c4d9b95b13e3eba09204fc.jpg", "checksum": "14c5d8463c6d06cce35230d365b0fecf", "status": "downloaded"}]},
{"title": "Roman Reigns named WWE 2k25 cover star, releases March 14", "detail_url": "https://tribune.com.pk/story/2525010/roman-reigns-named-wwe-2k25-cover-star-releases-march-14", "image_urls": ["https://i.tribune.com.pk/media/images/aitools-391738048857-0/aitools-391738048857-0.png"], "catagory": "Sports Desk", "content": "Roman Reigns, WWE’s “Head of the Table,” has been unveiled as the cover star for  . The announcement was made during the January 27 episode of   by Paul Heyman. Reigns will appear alongside his Bloodline family, including Jimmy and Jey Uso, Solo Sikoa, and Jacob Fatu, in the game. A special \"Bloodline Deluxe Edition\" is also confirmed, celebrating the faction's dominance in WWE history. During the January 6 premiere of   on Netflix, Heyman teased the cover reveal, hinting at a major announcement involving Reigns. The full reveal took place three weeks later. This marks Reigns' second appearance on a WWE 2K cover, following his feature with Becky Lynch in  . Since then, Reigns has solidified his legacy, becoming the longest-reigning Universal Champion, holding the title for over 1,300 days. The game’s trailer, shared during  , teased exciting new features, including what appears to be a city-inspired gameplay mode similar to NBA 2K. WWE Games also confirmed that   will release on March 14, 2025, with pre-orders beginning January 28. Fans can choose between various editions, including the Bloodline Deluxe Edition and another featuring The Undertaker on the cover.   COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/aitools-391738048857-0/aitools-391738048857-0.png", "path": "full/c1628cab84172b2d410d57760ceff0fae51e7184.jpg", "checksum": "744f06e2695e388fad2ea9e2eabe2503", "status": "downloaded"}]},
{"title": "PIA to hire aircraft technicians on daily wages", "detail_url": "https://tribune.com.pk/story/2525015/pia-to-hire-aircraft-technicians-on-daily-wages", "image_urls": ["https://i.tribune.com.pk/media/images/742772-PIAstorycopy-1406829462/742772-PIAstorycopy-1406829462.jpg"], "catagory": "News Desk", "content": "The management of Pakistan International Airlines (PIA) has decided to hire aircraft technicians on a daily wage basis. Interviews have started for more than 100 candidates who have completed apprenticeships at PIA and are being considered for contract-based employment. Engineering department officials have called the apprenticeship candidates for interviews. To address the shortage in the engineering department, PIA will recruit over 100 technicians on a daily wage basis, Express News reported. However, no decision has been made yet regarding recruiting aircraft engineers. The last fresh batch of aircraft engineers was recruited in 2016. A PIA spokesperson confirmed the decision to hire technicians on daily wages to address the shortage, and interviews for the candidates have already begun. The Society of Aircraft Engineers spokesperson also confirmed the new recruitments. Notably, 65 technicians and 45 aircraft engineers have resigned from PIA and joined domestic and international airlines. Yesterday, a   arrived in Pakistan to assess the country's aviation safety standards. The delegation from the UK Department for Transport and the Civil Aviation Authority (CAA) will review the Pakistan Civil Aviation Authority (PCAA) safety standards. This assessment is a crucial step towards Pakistani carriers' resumption of flight operations between Pakistan and the UK. The PCAA’s Director-General, Nadir Shafi Dar, and his team of experts are hosting the delegation. Previously, Prime Minister Shehbaz Sharif   an investigation into the controversial advertisement for the launch of PIA Paris flights. Deputy Prime Minister and Foreign Minister Senator Ishaq Dar shared this directive during a Senate session on Tuesday focused on a notice regarding PIA’s privatisation. Senator Sherry Rehman raised concerns about the airline’s future, questioning whether the privatisation plan had been cancelled or was still proceeding. She also highlighted that only 19 of PIA’s 34 aircraft are operational, with the rest grounded. Rehman also criticised the Paris flight advertisement, which she claimed led to public ridicule, questioning the agency responsible for the ad and the official who approved it. The advertisement featured a PIA plane near the Eiffel Tower with the tagline \"We’re coming,\" which she argued misrepresented the airline’s intentions. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/742772-PIAstorycopy-1406829462/742772-PIAstorycopy-1406829462.jpg", "path": "full/f735f622b59a832906c869e7c9aa6d1b19009050.jpg", "checksum": "5515fc5b678eacf9210fa07761ac988b", "status": "downloaded"}]},
{"title": "LHC seeks report on allotment issues", "detail_url": "https://tribune.com.pk/story/2524966/lhc-seeks-report-on-allotment-issues", "image_urls": ["https://i.tribune.com.pk/media/images/351738018534-5/351738018534-5.jpg"], "catagory": "Our Correspondent", "content": "Chief Justice Aalia Neelum of the LHC has directed the submission of a detailed report regarding alleged irregularities in the allotment of official residences. During the proceedings, Punjab Chief Secretary Zahid Akhtar Zaman and Advocate General Punjab Khalid Ishaq appeared before the court. The advocate general informed the court that a committee, led by the chief secretary, has been constituted to thoroughly investigate the matter. \"The findings of the committee will be presented before the court,\" Ishaq assured. At this, CJ Neelum remarked that the court neither desires any delay in this case nor will it provide further opportunities for adjournments. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/351738018534-5/351738018534-5.jpg", "path": "full/de2d903e371b48d0cf38739d66e10a844b734252.jpg", "checksum": "5570caf6ae865a6c2e22c06509fb3f27", "status": "downloaded"}]},
{"title": "Central Cee seemingly addresses drama with ex Madeline Argy in new track 'Now We’re Strangers'", "detail_url": "https://tribune.com.pk/story/2525013/central-cee-seemingly-addresses-drama-with-ex-madeline-argy-in-new-track-now-were-strangers", "image_urls": ["https://i.tribune.com.pk/media/images/befunky-collage-431738049112-0/befunky-collage-431738049112-0.jpg"], "catagory": "Pop Culture & Art", "content": "Central Cee’s latest track, \"Now We’re Strangers,\" from his debut studio album 'Can’t Rush Greatness', has fans speculating about the inspiration behind its reflective and regretful lyrics. The 26-year-old British rapper appears to delve into the aftermath of a past relationship, with many listeners drawing connections to his highly publicized TikTok drama with ex-girlfriend Madeline Argy.   From the opening lines, Cee sets a somber tone, reflecting on a former lover whose number he still knows \"by heart.\" He describes this person as being in a state of \"partyin’ and hoein’\" since their breakup, hinting at the emotional toll their separation took.   \"Broke my baby's heart, and now she's partyin’ and hoein’ / If I had a pound for every time I made her cry / Over couple years, then I could probably buy a Boeing / Paint a perfect picture of myself, it was a lie / She put my business on the net and now my true colors showin’,\" Cee raps, acknowledging his mistakes and the fallout from their relationship becoming public.   The track continues with Cee expressing remorse, admitting that he tried to buy his ex’s \"love\" but ultimately failed. He praises their maturity and self-worth while lamenting his own shortcomings, rapping, \"I’ll never learn.\" Despite his outward success, Cee reveals feeling \"sad\" and \"really numb inside,\" offering a rare glimpse into the emotional struggles behind his public persona.   The song’s release comes after a tumultuous period in Cee’s personal life. Last July, Argy took to TikTok to accuse him of infidelity, specifically alleging that he had cheated with fellow rapper Ice Spice. Argy claimed the drama was part of a larger \"marketing scheme,\" sparking widespread speculation and debate among fans.   Interestingly, Cee’s album opener, \"No Introduction,\" includes a subtle nod to Ice Spice with the line, *\"Think you’re the shit, bitch? Turn on your whip, does your engine fart?\"* This references Spice’s track \"Think U the Shit (Fart)\" from her 2024 album 'Y2K', which Jaylen Brown once called a \"worst song of all time\" contender on 'Complex’s GOAT Talk'.   As fans dissect the lyrics of \"Now We’re Strangers,\" the track has become a focal point of discussions about Cee’s personal growth and the complexities of his past relationships. With 'Can’t Rush Greatness', Central Cee not only solidifies his place in the rap scene but also opens up about the vulnerabilities behind his public image.   COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/befunky-collage-431738049112-0/befunky-collage-431738049112-0.jpg", "path": "full/121499ae0be447e08506b4d29fe2f1c2e77e72a7.jpg", "checksum": "51149887965129872a826bef28c87e1f", "status": "downloaded"}]},
{"title": "PETA protest against ASPCA fails as frozen manure mishap goes viral", "detail_url": "https://tribune.com.pk/story/2525016/peta-protest-against-aspca-fails-as-frozen-manure-mishap-goes-viral", "image_urls": ["https://i.tribune.com.pk/media/images/peta1738049574-0/peta1738049574-0.jpg"], "catagory": "Pop Culture & Art", "content": "On January 24, 2025, activists from People for the Ethical Treatment of Animals (PETA) protested outside the American Society for the Prevention of Cruelty to Animals (ASPCA) headquarters in Manhattan, New York City. The demonstration took a surprising turn when their attempt to dump a truckload of manure in front of the building failed due to freezing temperatures, which solidified the waste. He's lucky it didn't break free and crush him. Normally I'd make fun of this guy but his stupidity could have gotten him killed and that's not funny. It is an epic fail though because they're losers. I saw another caption that described the dirt as manure....even funnier. Manure has moisture in it; of course it will freeze when the temps are low. We had frozen horse ball fights at the barn; those things HURT! Videos of the incident quickly went viral, showing an activist struggling to break chunks of frozen manure from the truck. Efforts included climbing atop the truck to loosen the material, but they were unsuccessful. Social media users reacted with humor, with one commenting, “I’m guessing they don’t work construction very much,” while others pointed out the obvious effect of cold weather on moisture-rich manure. Real farmers know how to use a rigid rake and pole to poke it loose. The protest stemmed from PETA’s opposition to ASPCA’s endorsement of Global Animal Partnership (GAP) certifications for factory farms. PETA alleges that labels such as “animal welfare certified” mislead consumers into believing animals are treated humanely, even when evidence of cruelty persists in GAP-certified facilities. PETA claims these labels are marketing tactics rather than true guarantees of ethical practices. ASPCA defended its stance, stating that while factory farming is cruel and needs reform, their focus is on improving welfare standards within the current system. The organization criticized PETA’s approach, emphasizing their differing strategies toward animal welfare. Law enforcement intervened during the protest, detaining the PETA activist attempting to dump the manure and the truck driver. Both are scheduled to appear in court next month. Protesters carried signs reading, “ASPCA: Your Support of Factory Farming Stinks.” COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/peta1738049574-0/peta1738049574-0.jpg", "path": "full/9b7309752ae45a955392c2983e9a1c8d896a825f.jpg", "checksum": "aeec09d7a462a7cfb96f89be140d3d8a", "status": "downloaded"}]},
{"title": "Snoop Dogg responds to backlash after Crypto Ball performance: \"You can’t tear me down\"", "detail_url": "https://tribune.com.pk/story/2525017/snoop-dogg-responds-to-backlash-after-crypto-ball-performance-you-cant-tear-me-down", "image_urls": ["https://i.tribune.com.pk/media/images/fizza-2025-01-28t130313-9571738051579-0/fizza-2025-01-28t130313-9571738051579-0.png"], "catagory": "Pop Culture & Art", "content": "“It’s Sunday, I got gospel in my heart,” the 53-year-old said in the video, in which he was seen smoking while listening to gospel music in his car. “For all the hate, I’m going to answer with love. I’m cool. I’m together. Still a Black man. Still 100 percent Black.” Snoop used his platform to call for unity, addressing the negative comments he’s faced: “We gotta learn to pick each other up instead of pulling each other down. You can be up one minute, and they’ll try to pull you down the next. But I’m a strong Black man. You can’t tear me down.” Despite his performance at Trump’s event, Snoop emphasized that his approach to negativity is rooted in positivity. “The only way to beat hate is with love,” he concluded. Snoop’s decision to perform for Trump surprised many, given his outspoken criticism of the former president in the past. In 2016 Snoop publicly endorsed Hillary Clinton for the presidency. After Trump’s victory, he called out Black artists who performed at Trump’s inauguration, labelling them as “j***boos” and “Un*le T*ms.”  Then in 2018, he referred to Trump and his supporters as 'racists' during a SiriusXM interview. However, when Trump granted clemency to Michael “Harry-O” Harris, co-founder of Death Row Records, Snoop publicly thanked the president for the gesture, and his criticism of the former president mellowed. In a 2024 interview with The Sunday Times, Snoop shared, “He ain’t done nothing wrong to me. He has done only great things for me.” Following his performance, Snoop reportedly lost over 500,000 Instagram followers and nearly 20,000 on X (formerly Twitter). Critics took to social media to question his decision, but Snoop remains unfazed. Snoop wasn’t alone at the event. Rick Ross, Soulja Boy, Carrie Underwood, and others also performed at various inauguration celebrations. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/fizza-2025-01-28t130313-9571738051579-0/fizza-2025-01-28t130313-9571738051579-0.png", "path": "full/ea331dae3e5b26e94c937af389e0c0fd63d5a0aa.jpg", "checksum": "6fe0145b7784aa636ef7fb51e458402d", "status": "downloaded"}]},
{"title": "Cabinet committee reviews ministries progress", "detail_url": "https://tribune.com.pk/story/2524967/cabinet-committee-reviews-ministries-progress", "image_urls": ["https://i.tribune.com.pk/media/images/341738018534-4/341738018534-4.jpg"], "catagory": "Our Correspondent", "content": "A meeting of the Cabinet Committee on Rightsizing of the Federal Government on Monday chaired by Federal Minister for Finance Muhammad Aurangzeb to review progress on the implementation of rightsizing measures across federal ministries and deliberated on the rightsizing plan of railways ministry. The Establishment Division informed the minister about receiving confirmations from 29 ministries and one constitutional body regarding the abolition of 11,877 posts and 4,660 dying posts, said a news release. Aurangzeb commended the implementation of the committee's decisions and acknowledged the efforts of the ministries. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/341738018534-4/341738018534-4.jpg", "path": "full/53626ad043fb2a01bcbc4aeb6814351ce7f0052d.jpg", "checksum": "046503689317bc97161f7fb0c6357865", "status": "downloaded"}]},
{"title": "'Full-court can't be formed on demand'", "detail_url": "https://tribune.com.pk/story/2524968/full-court-cant-be-formed-on-demand", "image_urls": ["https://i.tribune.com.pk/media/images/331738018534-3/331738018534-3.jpg"], "catagory": "Our Correspondent", "content": "The Constitutional Bench (CB) of the Supreme Court on Monday finally took up petitions challenging the 26th Constitutional Amendment, 2024 which was bulldozed through parliament in October last year and which paved the way for formation of the CB within the apex court. An eight-member CB led by Justice Aminuddin Khan commenced hearing the petitions that claim that the 26th amendment has undermined the independence of judiciary, making it subservient to the executive arm of the state. At the outset of the proceeding, lawyers of the petitioners urged the bench to form a full-court to hear the petitions. Responding to the request, Justice Jamal Khan Mandokhail remarked that a full court cannot be formed according to anyone's wishes. He said the nomination of judges for the CB is made by the Judicial Commission of Pakistan (JCP), and all judges nominated for the CB are already part of the existing bench. \"While the JCP nominates the judges, a three-member committee comprising Justice Aminuddin Khan, Justice Muhammad Ali Mazhar and myself list cases before the CB,\" he said. During the proceedings, Justice Mazhar also engaged with the lawyers requesting a full court. \"You seem confused about the full court. One lawyer suggests forming a full court through a judicial order, while another asks for a referral for the full court. Decide among yourselves first.\" He asked them to consider the bench as a full court. \"Only a CB can hear constitutional matters and all members of the CB are part of this bench,\" he said. Justice Mandokhail noted that the current bench effectively acts as a full court for this case. He said even if a full-court is formed, the petitioners may raise objections to it and may demand exclusion of the CB members, contending that CB is formed through the 26th amendment which is under review. Petitioner's counsel Uzair Bhandari argued that the 26th Constitutional Amendment, 2024 was passed when the house was incomplete as elections at Senate seats from Khyber Pakhtunkhwa (K-P) province had not yet been held. Justice Mandokhail asked Bhandari if the 26th amendment was not passed with a two-thirds majority. \"If so, how could the house have been incomplete? Was there any objection raised about the house being incomplete or the quorum not being met?\" The counsel contended that the amendment was passed in secrecy without debate. Lawyer for another petitioner, Shahid Jameel, argued that without a clear mandate, an amendment cannot proceed. He said a number of election-related petitions are still pending before tribunals. Justice Mazhar stated that election petitions must be dealt with by election tribunals. \"According to your argument, hearings on the 26th Constitutional Amendment, 2024 should be delayed until those petitions are resolved. This would mean putting the amendment hearings on hold indefinitely.\" Counsel Sheikh Ehsanuddin argued that the 26th amendment has had profound effects. He said the amendments had allowed individuals previously disqualified to join the judiciary. The court later issued notices to all parties and adjourned the hearing for three weeks. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/331738018534-3/331738018534-3.jpg", "path": "full/32973a19ffc18d024d8e426efc241e435a3adfaf.jpg", "checksum": "bed43c1826f76c85f5a49393a89bc434", "status": "downloaded"}]},
{"title": "HEC bill sparks PPP, PML-N dispute", "detail_url": "https://tribune.com.pk/story/2524969/hec-bill-sparks-ppp-pml-n-dispute", "image_urls": ["https://i.tribune.com.pk/media/images/321738018533-2/321738018533-2.jpg"], "catagory": "Safdar Rizvi", "content": "The Higher Education Commission Amendment Bill has sown a discord in the ruling coalition as President Asif Ali Zardari used his clot to prevent the bill, transferring maximum powers to the Prime Minister, from being tabled in the joint session of the parliaments held on Friday. The bill proposed transfer of the commission's powers to the Prime Minister. Such powers include appointment of the executive director, formation of the commission and nomination of vice chancellor in the federal commission. The bill recommended maximum powers of the HEC to the Prime Minister. The President House sources told The Express Tribune that the bill in question attempted to defang the powers of the federal education commission. As per the draft of the amendment bill, available with The Express Tribune, the power of appointing the executive director of the HEC will be vested with the Prime Minister whereas the commission is autonomous as per the prevailing laws and he appoints only the HEC chairman and few members of the commission. The bill also recommends curtailing the numbers of commission's members to 10. Of which, four education experts, IT experts and scientist will be nominated by the Prime Minister. The chairmen of provincial HECs will also be the members of the commission. It is pertinent to mention that the provincial commissions are only functional in Sindh and Punjab, thus rendering K-P and Balochistan deprived of representation in the commission. Moreover, the commission will propose the names of three vice chancellors (VCs) each from public and private sector universities to the Prime Minister and he will select one each from both sectors. At present, the VCs become a part of the commission through a selection by its own committee while the chief ministers also nominate a VC in the commission. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/321738018533-2/321738018533-2.jpg", "path": "full/a33c5b31405dcb6379010e9d5f6cb48b11bbfb8c.jpg", "checksum": "bfbcf59f5a3abe76883262aceefb2e00", "status": "downloaded"}]},
{"title": "China supports Balochistan's uplift", "detail_url": "https://tribune.com.pk/story/2524970/china-supports-balochistans-uplift", "image_urls": ["https://i.tribune.com.pk/media/images/311738018533-1/311738018533-1.jpg"], "catagory": "APP", "content": "The embassy of China in Pakistan on Monday said on Monday that China always supported the construction of Gwadar Port and the development of Balochistan. The Chinese embassy spokesperson, while reacting to an article in UK-based The Guardian, said that rhetoric and wording imposed were not credible and lacked the basic understanding of China's position. \"We have noted that the recent article in The Guardian, allegedly quoted the remarks of a Chinese diplomat, which is completely untrue,\" the spokesperson stated. The spokesperson said that the author's practice of unilaterally fabricating false information without prior consent for an interview violated professional ethics and breached basic respect for the common understanding. The spokesperson said that over the past year, with joint efforts of our two countries, series of positive progress had been made. \"In March last year, we provided $100,000 in emergency cash assistance for disaster relief work in Balochistan,\" the spokesperson added. \"In May, China transported 10,000 sets of solar lighting equipment to be distributed in Balochistan. Similarly, in June, we handed over the Gwadar the China-Pakistan Friendship Hospital and the Gwadar desalination plant,\" he continued. \"In July, we organised a media delegation from Balochistan to visit China while in August, 20,000 sets of health kits were distributed to Balochistan. In October, the new Gwadar International Airport was successfully completed and in November, we organised delegations from all walks of life in Gwadar to visit China.\" He said that in December, outstanding Pakistani staff of the CPEC project, including those in Balochistan were awarded. \"The embassy will soon award Chinese Ambassador Scholarships to students in Balochistan University, Sardar Bahadur Khan University and Gwadar University,\" he added. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/311738018533-1/311738018533-1.jpg", "path": "full/956628138d9205d6008a72318263cfe52ded1d65.jpg", "checksum": "417f1253d017112ff60de360fca0d162", "status": "downloaded"}]},
{"title": "Oscar Nominees Under Fire Over Racist & Problematic Pasts, Fernanda Torres Apologises for Blackface", "detail_url": "https://tribune.com.pk/story/2525014/oscar-nominees-under-fire-over-racist-problematic-pasts-fernanda-torres-apologises-for-blackface", "image_urls": ["https://i.tribune.com.pk/media/images/t-edit-article-images1738048785-0/t-edit-article-images1738048785-0.jpg"], "catagory": "", "content": "", "publication_date": null, "images": [{"url": "https://i.tribune.com.pk/media/images/t-edit-article-images1738048785-0/t-edit-article-images1738048785-0.jpg", "path": "full/698539d7b3130acd9e84c0eb6c0e725e4a456c48.jpg", "checksum": "9902960f1eeff82f76396e9b0868f2d4", "status": "downloaded"}]},
{"title": "Huddle mulls over anti-terror policy", "detail_url": "https://tribune.com.pk/story/2524971/huddle-mulls-over-anti-terror-policy", "image_urls": ["https://i.tribune.com.pk/media/images/301738018534-0/301738018534-0.jpg"], "catagory": "Our Correspondent", "content": "Khyber-Pakhtunkhwa Chief Minister Ali Amin Gandapur has stressed unity among all stakeholders as he led a meeting to chalk out a national policy to combat terrorism. A consultative meeting titled National Unity Against Terrorism was hosted by Gandapur at the K-P House in Islamabad on Monday. The meeting was attended by representatives from various political and religious parties, including Jamaat-e-Islami, Jamiat Ulema-e-Pakistan, Majlis Wahdat-e-Muslimeen, Tehreek Minhaj-ul-Quran, Islamic Tehreek, Central Ulema Council, Pakistan Tehreek-e-Insaf, and others. Prominent leaders present at the meeting included Barrister Gohar, Asad Qaiser, Muhammad Ali Durrani, Professor Ibrahim, Liaqat Baloch, Sahibzada Abu-al-Khair Muhammad Zubair, Syed Nasir Abbas Shirazi, Allama Arif Hussain Wahidi, and Sahibzada Zahid Mehmood Qasmi, among others. Addressing the participants, Chief Minister Gandapur stated that the meeting was convened on the directive of Pakistan Tehreek-e-Insaf Chairman Imran Khan with the aim to have consultation on creating a comprehensive national policy to combat terrorism, sectarianism, ethnic division, and lawlessness, ensuring the rule of law across the country. The chief minister thanked all participants, emphasising the urgent need for national unity in light of the challenges facing Pakistan. \"Due to past policy failures, the country is now grappling with terrorism, sectarianism, ethnic division, and lawlessness,\" he said\", adding that it is time to think about the kind of country we want to leave for future generations. \"If we aim to leave a better Pakistan, we must formulate and implement a robust policy against terrorism, sectarianism, and other divisive issues.\" He further highlighted the role of religious scholars in fostering unity and countering sectarianism stating that any effort against terrorism cannot succeed without public support whereas the role of religious scholars is crucial in ending sectarianism, and political and religious parties must rise above political affiliations to ensure the supremacy of law. The chief minister also praised the efforts of Barrister Muhammad Ali Saif and Muhammad Ali Durrani in bringing together such a diverse group of leaders. He expressed hope that this meeting would lay the foundation for lasting peace and national unity. He said that the proposals shared during this meeting will shape the way forward; and a committee will be formed to ensure their implementation, followed by a follow-up session to be held soon in Peshawar, with an aim to involve more stakeholders. Regarding Afghanistan, Gandapur reiterated his stance that dialogue is the only solution to resolving issues with the neighbouring country. He also revealed plans to send a delegation to Afghanistan, comprising representatives from various sectors. Participants of the meeting commended the chief minister for his initiative, describing it as a significant step toward addressing national challenges. They urged other provincial and federal governments to follow suit. Tackling terrorism, sectarianism, ethnic prejudice, and lawlessness requires a united national front, they noted. The session concluded with a joint declaration, and participants emphasissd the need for continuity in such consultations to achieve sustainable peace and national integration. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/301738018534-0/301738018534-0.jpg", "path": "full/2c19a17f179bb5b817089932c959f53ce7630629.jpg", "checksum": "eb7c1d8464529e1a21bc935f2d28b967", "status": "downloaded"}]},
{"title": "SBP cuts key policy rate by 100bps", "detail_url": "https://tribune.com.pk/story/2524973/sbp-cuts-key-policy-rate-by-100bps", "image_urls": ["https://i.tribune.com.pk/media/images/796567-sbpstorycopy-1416861691/796567-sbpstorycopy-1416861691.jpg"], "catagory": "Usman Hanif", "content": "The Monetary Policy Committee (MPC) of the State Bank of Pakistan (SBP), in its meeting on Monday, announced the sixth successive cut of a 100 basis point cut in the policy rate, bringing it down to 12 per cent, effective January 28, 2025. The decision comes amid key economic developments, including improved activity in the real sector, a cumulative surplus in the current account, a significant increase in revenue, and rapidly declining inflation. \"In its meeting today, the MPC decided to cut the policy rate by 100 bps to 12 per cent, effective from January 28, 2025,\" SBP Governor Jameel Ahmad said in a news conference after the meeting. The decision reflects optimism over declining inflation, which reached 4.1% in Dec, driven by moderate domestic demand and supportive supply-side factors. detailed story inside COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/796567-sbpstorycopy-1416861691/796567-sbpstorycopy-1416861691.jpg", "path": "full/99e6ffba2622519ecdadf36ab3ae1d2aa675d17f.jpg", "checksum": "8c6968cd40ec13280fb9813b3b409472", "status": "downloaded"}]},
{"title": "Bobbi Althoff denies Tyga dating rumors after rapper calls her a 'cheater' in viral livestream", "detail_url": "https://tribune.com.pk/story/2524972/bobbi-althoff-denies-tyga-dating-rumors-after-rapper-calls-her-a-cheater-in-viral-livestream", "image_urls": ["https://i.tribune.com.pk/media/images/bobbi1738019886-0/bobbi1738019886-0.png"], "catagory": "Pop Culture & Art", "content": "TikTok star Bobbi Althoff, 27, has firmly denied rumors of a romantic relationship with rapper Tyga, 35, following a viral livestream interaction where Tyga called her a \"cheater.\" In an emotional TikTok video posted earlier today, Althoff set the record straight. \"I'm not dating Tyga. I was never dating Tyga. I will never be dating Tyga,\" she said, emphasizing that the rapper is a friend she met during a past interview. Bobbi responds to allegations she is dating Tyga The rumors started when a clip from Tyga's livestream showed the pair talking in a games room. Fans speculated about their relationship after Althoff was seen smirking during an exchange where Tyga accused her of deleting text messages, which he claimed was behavior typical of \"cheaters.\" Althoff dismissed the claims, calling the speculation baseless. \"Sometimes the internet surprises me,\" she said. \"People have no brain cells to think this makes sense.\" Althoff also addressed the scrutiny she faces about her personal life, including criticism for keeping her two daughters off social media. \"I don’t post my kids and I’m not going to start to validate how good of a mother I am,\" she stated. This drama follows Althoff’s recent admission that she’s single after briefly dating someone following her split from ex-husband Cory Althoff in July 2023. The couple, who share two daughters, divorced in early 2024. While Althoff dismissed the Tyga rumors, fans remain divided, with some insisting their interactions were suspicious. Others defended her, stating that privacy should not equate to dishonesty. Despite the rumors, Althoff continues to focus on her podcast, where she interviews stars like Drake and Meghan Trainor, showcasing her signature deadpan style. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/bobbi1738019886-0/bobbi1738019886-0.png", "path": "full/ac7e0cf23a36ce80a89da1f107a231743a82ae38.jpg", "checksum": "560a2e6291a9825fd4754d86d8229532", "status": "downloaded"}]},
{"title": "PM takes a dig at PTI for scuttling talks", "detail_url": "https://tribune.com.pk/story/2524974/pm-takes-a-dig-at-pti-for-scuttling-talks", "image_urls": ["https://i.tribune.com.pk/media/images/411738019557-0/411738019557-0.jpg"], "catagory": "Rizwan Shehzad  ", "content": "Amid changing stances of the Pakistan Tehreek-e-Insaf (PTI) on the talks with the Pakistan Muslim League-Nawaz (PML-N)-led coalition government, Prime Minister Shehbaz Sharif said on Monday that avoiding dialogue was an undemocratic attitude that damaged the national unity. The prime minister said that communication and dialogue between political parties was the soul of democracy, adding that these communications helped develop a common strategy to resolve problems faced by the country and the nation. The prime minister's statement came on the heels of the PTI's decision to initially boycotting the negotiations and then linking them to the ruling alliance's announcement of establishing two separate judicial commissions to investigate May 9, 2023 and November 26, 2024 incidents. It also came at a time when the PTI leadership has already announced that it would not attend the fourth round of talks scheduled to be held on January 28 (today), if its demands were not accepted. The government has not yet accepted any of the PTI's demands, including release of political prisoners. \"Avoiding dialogue reflects an undemocratic attitude, fosters an environment of tension and harms the spirit of national unity,\" Shehbaz said in a meeting with the spokesperson of the government's negotiation committee, Senator Irfan Siddiqui, at the Prime Minister's Office. Shehbaz stressed that Pakistan required reconciliation and harmony rather than chaos, confrontation, and conflict. He underscored the importance of adopting a unified strategy to tackle critical issues, such as rebuilding the national economy and eradicating terrorism. The prime minister further stated that the country was progressing and its global stature was improving. \"No one will be allowed to hinder this journey of development and progress through undemocratic practices,\" Shehbaz said. Senator Siddiqui had called on the prime minister to brief him on the negotiations held with the PTI committee, so far. The government and the opposition have held three rounds of talks, so far, including their maiden parleys on December 23, 2024. The first two meetings could not go beyond optics, but in the third meeting, the PTI finally submitted in charter of demands to the government. The PTI negotiation committee presented the demands only after their meeting with jailed PTI founder Imran Khan in the Adiala jail. The PTI charter included two main demands formation of two judicial commissions; and \"support\" of the federal and provincial governments in bail, sentence suspensions and acquittals of \"political prisoners\" identified by the PTI. The PTI charter had stated that the demands were presented as a \"prerequisite to wider negotiations with respect to the restoration of the Constitution, the rule of law, respect for the people's mandate, and free and fair elections\". However, seven days after the third round, the PTI founder abruptly called off the dialogue, on the grounds that the government had not accepted its demands within a week's time. Siddiqui, however, had termed the unilateral decision of boycotting talks \"unfortunate\". Siddiqui had said that the PTI itself had agreed in the joint statement issued after the third meeting that the government would respond to its demands within \"seven working days.\" He had subsequently urged the PTI to review its decision. A day after announcing the end of the talks, PTI Chairman Barrister Gohar Ali Khan deviated from his previous statement and said that Imran Khan had put the talks on hold, adding that the PTI could mull over the talks resumption only if the government constituted the judicial commissions. Despite the PTI's announcement of boycott, National Assembly Speaker Ayaz Sadiq called a meeting of the negotiation committees on January 28 (today) at 11:45am at the Parliament House. Siddiqui had told media that the government's response would be presented in the meeting. For his part, Speaker Ayaz Sadiq, who is the main figure in these talks, telephoned the PTI negotiation committee head Omar Ayub and invited him to in the meeting with the government side on Tuesday (today). In his conversation, the speaker emphasised that dialogue was the only viable solution to resolving all issues, emphasising the importance of finding a common ground on contentious issues through table talks and negotiations. Ayub expressed concerns over the government's use of delaying tactics in addressing the PTI's demands. He insisted that negotiations could not proceed without the formation of the judicial commissions, which remained a critical demand of the PTI. Commenting on these developments, the government committee spokesperson, Senator Siddiqui, told a private news channel that the government would also disband its negotiations committee if the PTI did not attend the next meeting. Currently, both sides are emphasising the importance of dialogue but simultaneously holding firm on their respective preconditions; resulting in a stalemate. PTI Chairman Barrister Gohar repeated on Monday that they would not participate in talks and that the decision had officially been conveyed. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/411738019557-0/411738019557-0.jpg", "path": "full/7d4a74efba47de93d5753b6d9daaed6a3e7916f5.jpg", "checksum": "4b81535af53081e00442371c18335743", "status": "downloaded"}]},
{"title": "All is not well among brother judges", "detail_url": "https://tribune.com.pk/story/2524976/all-is-not-well-among-brother-judges", "image_urls": ["https://i.tribune.com.pk/media/images/441738019557-3/441738019557-3.jpg"], "catagory": "JEHANZEB ABBASI", "content": "A division bench of the Supreme Court has exonerated its additional registrar of contempt charges but noted that both the SC committees responsible for listing cases before regular and constitutional benches \"illegally\" withdrew a case from the bench and are liable for contempt of court. Interestingly, the committee responsible for listing cases before regular benches of the SC comprise CJ Yahya Afridi, Justice Syed Mansoor Ali Shah and Justice Aminuddin Khan The three-member committee responsible for listing cases before the Constitutional Bench (CB) includes Justice Aminuddin Khan, Justice Jamal Khan Mandokhail and Justice Muhammad Ali Mazhar. The bench comprising Justice Syed Mansoor Ali Shah and Justice Aqeel Ahmed Abbasi on Monday issued its written order in a contempt of court case initiated against Additional Registrar (Judicial) Nazar Abbas. The bench issued show cause notice to Abbas over alleged contempt of court after a bunch of cases in which vires of Custom Act, 1969 were challenged were withdrawn from the bench and were referred back to the CB committee for re-listing. The court noted that upon examining the case, it found that Abbas did not deliberately avoid the listing of the cases before the bench as directed in the court order. \"There is no evidence to suggest that he had any personal interest in the matter or had connived with any of the parties to the case, nor did he act with the intention of causing damage to any of the parties to the case. There is no indication of mala fide intent in his actions. \"In the absence of any such factors or elements of contumacy, his conduct cannot be considered contumacious, nor can it be said to have suffered from mala fides, requiring contempt proceedings. \"For these reasons, by accepting his explanation, the show cause notice issued against him for contempt proceedings is discharged,\" it said. The court noted that it also deliberated on the question as to whether, following the discharge of the show-cause notice against the additional registrar (judicial), the matter should be considered concluded or whether it should proceed further against the members of the two committees. The bench said the first committee led by CJ Afridi \"unlawfully\" withdrew the part-heard cases from a bench and transferred it for the consideration of the other committee, through an administrative order by undoing the effect of a judicial order. \"While the second Committee, in total disregard of the judicial order passed by the regular Bench, simply in pursuance of the direction of the first Committee, went ahead and fixed the case before the Constitutional Bench on 27 January 2025. \"Both the Committees were not legally authorized to take administrative decisions dated 17 January 2025 in violation of the judicial order,\" it added. In this background, it said, it appears that the matter has to proceed further against the members of the two committees. \"However, judicial propriety and decorum demand that the said question be considered and decided by the Full Court of the Supreme Court so that it is authoritatively decided once and for all,\" it added. The bench made it clear that it was not referring the matter to the committee constituted under Section 2 of the Practice and Procedure Act, 2023 as its authority is limited to constituting benches \"The Full Court of the Supreme Court, however, is constituted by the Constitution itself under Article 176. The distinction between the benches of a Court and the Full Court is well-established and constitutionally recognized in the provisions of Article 203J(2)© and (d) of the Constitution and the responsibility of convening the Full Court conventionally falls within the domain of the CJ.\" The division bench order also noted that no one is entitled to disobey or decline compliance with the court order merely because he believes it to be inconsistent with the Constitution and the law. \"When a Bench is seized of a case and has partly heard it, the matter becomes part of judicial proceedings, and the Bench hearing the case assumes exclusive jurisdiction over it. \"Any interferencewhether through withdrawal or reassignmentwithout judicial justification undermines the principle of judicial independence,\" it said After unveiling of the verdict, a six-member larger bench that was hearing the additional registrar's intra-court appeal against the show cause notice issued by Shah led bench disposed of the ICA. However, during the proceeding, head of the bench, Justice Jamal Khan Mandokhail asked as to how an order was issued when the contempt proceedings were terminated. \"The verdict [of Shah led bench] includes the chief justice among the alleged contemnors. Will those accused of contempt form the full court?\" he questioned. Justice Muhammad Ali Mazhar remarked that the contempt of court law lays out a complete procedure, which includes issuance of a notice first. \"Everyone in the world is entitled to the right to a fair trial under Article 10-A. Are judges who are held as contemnor not entitled to the protections of Article 10-A?\" \"Will the full court formed include the four judges accused of contempt? They could have issued a notice, and we, the four judges, would have appeared before their court,\" He added. Later, a majority of four judges stated in the short order that the intra-court appeal was disposed of, with detailed reasons to be provided later. However, two judges, Justice Athar Minallah and Justice Shahid Waheed, agreed only to the extent of disposing of the case but disagreed with the majority of four judges on issuing detailed reasons. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/441738019557-3/441738019557-3.jpg", "path": "full/4d5f2149745bfa28358fa3dd6e9137ca6e4466c7.jpg", "checksum": "d1b45cef50f6d769ab8d4b992c62d391", "status": "downloaded"}]},
{"title": "Acrimony at its peak", "detail_url": "https://tribune.com.pk/story/2524977/acrimony-at-its-peak", "image_urls": ["https://i.tribune.com.pk/media/images/331738018534-3/331738018534-3.jpg"], "catagory": "Hasnaat Malik", "content": "A clash has intensified between the judges of the Supreme Court's regular benches and those appointed to its constitutional benches (CB), formed in accordance with the 26th Constitutional Amendment, 2024. Now judges from both sides have started passing judicial orders and remarks against each othersomething which was unprecedented in recent judicial history. This trend of questioning each other's conduct publicly will give more confidence to the executive to further weaken the judiciary as an institution. The superior judiciary started weakening, when chief justices began to form benches comprising \"likeminded\" judges to get favorable judicial orders in high profile cases with potential to shape national politics. Since the era of former chief justice Mian Saqib Nisar, SC judges have been divided into two camps. Divide among judges increased, when the PTI led government filed a presidential reference seeking removal of Justice Qazi Faez Isa. One section of judges was also interested in ousting him. However, they could not succeed in the end. Judicial politics intensified when Qazi Faez Isa took oath as the top judge. Two SC judgesIjaz ul Ahsan and Sayyad Mazahar Ali Akbar Naqvi, who were originally not in Isa's rival camp, were forced to resign last year. Even a larger bench led by Aminuddin Khan held that the Supreme Judicial Council (SJC) could proceed against retired judges under Article 209 of the Constitution. There is perception that the purpose of ruling was to oust Mazahar Ali Akbar Naqvi on account of misconduct after his resignation. After the SC ruling, the SJC declared Naqvi guilty on several charges. After the SC's reserved seats verdict of July 2024, clashes among SC judges further intensified. One section of judges in their minority view had held that the institutions are not bound to implement \"unconstitutional judicial orders\". The same section of judges led by Justice Isa facilitated the passage of the 26th Constitutional Amendment. However, the executive did not agree to extend the tenure of Isa due to several reasons. After the 26th Constitutional Amendment, like-minded judges of former CJ Isa were selected for the constitutional bench by the Judicial Commission of Pakistan (JCP). Justice Aminuddin Khan was selected as head of the constitutional bench by non-judicial members of the JCP. Now the beneficiaries of 26th Constitutional Amendment are on one side and those aggrieved by the amendment are on the other side. The constitutional bench has delayed the adjudication of the 26th Constitutional Amendment case. Now the government is likely to be successful in appointing eight more like-minded judges to the apex court through the JCP. It has already succeeded to appoint judges of its choice in the Islamabad High Court and the Sindh High Court. Lahore High Court former judge Shahid Jamil Khan said proceedings in three cases at the Supreme Court have aggravated the judicial chaos. \"The bench led by Justice Syed Mansoor Ali Shah has discharged the additional registrar from contempt proceedings, but has referred the matter for constitution of Full Court, to the Chief Justice of Pakistan, observing that a judicial order has been ignored by the members of two SC committees. \"In my opinion, the question regarding jurisdiction of the regular and constitutional bench should have been referred to the full court rather than the contempt case.\" He said two members of the appellate bench, constituted against the show cause notice issued to the additional registrar have already reacted to the division bench's order. \"The case has been disposed of through a split decision. Two judges of the bench have allowed the application for withdrawal of appeal whereas four judges have disposed of the contempt petition with some observations to be recorded later.\" The former LHC judge stated that the observations shall surely escalate the controversy and further polarize an already divided Supreme Court. \"In addition, the cases in which the question of jurisdiction was raised before a regular bench have been listed before the constitutional bench, in presence of the judicial order by the regular bench and particularly in presence of the direction in the judgment delivered today that case be fixed before the same bench in February. \"The constitutional bench shall hear the case tomorrow and observations or any order in the proceedings is expected to broaden the controversy. \"The only solution consistently being suggested by the lawyers appearing before all benches is that a full court be constituted for an authoritative institutional view by the Supreme Court. \"But to the utter surprise of everyone, the JCP is convened to appoint eight more judges in the Supreme Court. \"This will be taken as an attempt to outnumber judges who might opine in extension of jurisdiction to Regular Benches matters involving constitutional interpretation.\" He said the constitutional bench hearing petitions against 26th Constitutional Amendment was skeptical in recording the grounds challenging their jurisdiction being creation of the impugned amendments in the Constitution. Khan said it appeared that bothhaves and have notare fighting for judicial review powers against the legislative action, ignoring that they all are judges collectively forming the Supreme Court along with chief justice under Article 176. He said the members belonging to the executive side and dominating the JCP would be replaced with a change of regime. Khan said the divide sowed by the 26th Constitutional Amendment through Article 191A, shall continue, demolishing the separation of power and independence of judiciary as fundamental salient features of the Constitution. Abdul Moiz Jaferii Advocate said a notice of contempt was appealed against before a supposedly constitutional bench. Right at the start, the appellant's lawyer said he was no longer aggrieved as the contempt charge had been dropped against the appellant by the bench which started it. \"What followed cannot be considered judicial proceedings because there was nothing left to adjudicate. It would have been better termed a press conference if it had been live-streamed\". Jaferii said all the pretense has been dispensed with. \"But the show must go on, with the lead actors once again pretending that there is nothing to see here.\" Rida Hosain Advocate said in October last year, Justices Syed Mansoor Ali Shah and Munib Akhtar directed that the 26th amendment challenges be listed for hearing before a full court. \"This order of the committee was defied. Now, when a regular bench led by Justice Shah was examining the ouster of jurisdiction under the 26th amendment, the case was unlawfully unwithdrawn from him. \"First an administrative order of the committee was defied, and now a judicial order has been violated. \"The 26th amendment is a clear assault on judicial independence, and it is regrettable that the judiciary has not been able to unite. \"The failure of the judges to unite has allowed the executive to encroach on their domain, and has eroded the credibility of the institution. \"Ultimately, the 26th Constitutional Amendment has achieved what it was designed to do. Constitutional cases of public importance are heard by a government-approved constitutional bench. Meanwhile, judges on the regular bench struggle to preserve their jurisdiction,\" she added. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/331738018534-3/331738018534-3.jpg", "path": "full/32973a19ffc18d024d8e426efc241e435a3adfaf.jpg", "checksum": "bed43c1826f76c85f5a49393a89bc434", "status": "downloaded"}]},
{"title": "Pakistani elite hid billions, reveals FBR chief", "detail_url": "https://tribune.com.pk/story/2524978/pakistani-elite-hid-billions-reveals-fbr-chief", "image_urls": ["https://i.tribune.com.pk/media/images/express-tribune1738040735-0/express-tribune1738040735-0.jpg"], "catagory": "Shahbaz Rana", "content": "In a startling disclosure, Pakistan's tax chief said on Monday that there were hardly 12 Pakistanis who declared wealth of Rs10 billion ($36 million) or more in their returns a statement that shows the collapse of the tax machinery and its inability to expand the narrow base. The Federal Board of Revenue (FBR) Chairman Rashid Langrial made the statement in his defence to stop the economic transactions like buying property, car or maintaining a bank account by ineligible persons, either filers or non-filers. \"Only 12 people declared assets of more than Rs10 billion in the last year, which is a huge under declaration\", Langrial told the National Assembly Standing Committee's subcommittee on the issue of proposed restrictions on the real estate sector. The meeting was chaired by Bilal Azhar Kayani, a member of the National Assembly (MNA) belonging to the Pakistan Muslim League-Nawaz (PML-N). \"Only 12 people with officially declared wealth of Rs10 billion or more does not reflect the true wealth of the Pakistanis. There are hundreds of housing societies in Pakistan and many dozens around Islamabad and Rawalpindi,\" the FBR chairman continued. India has over 100 richest persons with net worth in billions of dollars. India's 100th richest person's worth is $3.3 billion, while its richest person Mukesh Ambani's net worth is $119.5 billion, according to the Forbes. \"For the past 78 years, we have been running the country on excuses that measures to broaden the tax base can undermine the economy and it is not just the responsibility of the FBR to expand the tax base and run the system of the country,\" remarked the chairman FBR. Langrial stressed that economic activities should have a link with the personal wealth of the people. The government has proposed to disrupt economic transactions by people whose tax returns do not support such major purchases. There is also a proposal that only those persons can buy the property, whose declared assets can support such transactions. If the value of the declared asset is Rs100, the buyer can buy a property of up to Rs130 value, according to the proposal. The FBR should consider exempting the reconciliation of up to Rs50 million assets, which will allow the people to declare their assets, recommended Arif Habib. \"The draft bill is very dangerous and it leaves the buyers and the sellers of the property at the mercy of people who are ready to exploit,\" he added. Habib further said that the businesses were badly affected in recent times and the people invested only in gold and dollars. What is the need for introducing a proposal to stop purchase of properties by ineligible persons when the people have the legal obligations to file their income tax returns and the wealth statements at the end of the fiscal year, remarked Kayani, the convener of the committee. In the last fiscal year, a little fewer than 1.7 million property transactions were carried out and 93.7% transactions had a value of less than Rs10 million, said Langrial. He added that there were only 2.5% transactions that would be affected by the new legislation. \"Our objective is to target only 2.5% households,\" Langrial said. However, Ashfaq Tola, the president of the Tola Associates a tax advisory firm – warned the FBR not to disrupt the system for the sake of 41,801 or 2.5% transactions. The FBR should not bring the entire real estate sector under the clouds for these few thousands transactions, he said. Tola added that if the FBR could not handle these 41,801 people without disrupting the entire system then there was a serious question mark on the ability of the system. The FBR had shared the value-wise brief of the 1.7 million property transactions during the last year. Only 3,250 transactions having value of more than Rs50 million were declared with the property registration authorities in the last year. The actual prices are far higher than the declared values of these properties at the time of registration, said MNA Jawad Hanid Khan. The FBR should first explain the results of the powers of blocking the sim cards and disconnect the electricity and gas connections before asking for new powers, said MNA Usama Ahmed Mela. Langrial said that the taxes could not be recovered through normal means until the entire system was changed, all the officers of the FBR were honest and the civil laws were reformed. He confessed that there were thousands of people who were buying properties every year, they were filers but still did not disclose those assets in their returns. \"The decision to stop property transactions by ineligible persons would open new avenues of money laundering from Pakistan,\" warned MNA Muhammad Mobeen Arif. Langrial replied that the FBR was conscious of the fact that the housing sector had been affected and \"the FBR has a role in it\". In order to reverse the trend, He added, the government was seriously considering reducing taxes on the property transactions, subject to certain approvals. Dr Hamid Atiq Sarwar, member operations of the FBR, said that during the first half of this fiscal year, 735,000 property transactions were carried out and out of which 500,000 transactions were by the non-filers. He said that post-purchase of asset audits did not help, as the success rate was only 3%. \"The proposals are no more in the hands of the FBR and it is now up to the standing committee what kind of decision it takes, Langrial said. The sub-committee would meet again on Thursday to propose a way forward. It emerged during the discussion that the panel may recommend to the National Assembly that in case the property value was below Rs10 million, there should not be any requirement to first justify the source of buying the property. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/express-tribune1738040735-0/express-tribune1738040735-0.jpg", "path": "full/c3aa84873f2cd2d1905815555e1e5a211e93067d.jpg", "checksum": "d84fb73cce351a697efa34259f3cbfb0", "status": "downloaded"}]},
{"title": "Blake Lively and Justin Baldoni’s ‘It Ends With Us’ legal battle heads to trial in March 2026", "detail_url": "https://tribune.com.pk/story/2524981/blake-lively-and-justin-baldonis-it-ends-with-us-legal-battle-heads-to-trial-in-march-2026", "image_urls": ["https://i.tribune.com.pk/media/images/blake-justin1734950159-0/blake-justin1734950159-0.jpg"], "catagory": "Pop Culture & Art", "content": "The legal battle between Blake Lively and Justin Baldoni is heating up, with a trial date now set for March 9, 2026, according to an order filed by Judge Lewis J. Liman in the U.S. District Court for the Southern District of New York. The lawsuit stems from allegations by Lively, 37, who accused Baldoni, 41, and several associates at Wayfarer Studios of sexual harassment and launching a smear campaign in retaliation for her speaking out about misconduct. Baldoni, in turn, has filed a $400 million countersuit against Lively, her husband Ryan Reynolds, and their publicist Leslie Sloane, alleging defamation and extortion. Lively’s legal team has dismissed Baldoni’s countersuit as “meritless” and “desperate,” while Baldoni’s attorney, Bryan Freedman, has called her allegations “false, outrageous, and intentionally salacious.” A pre-trial hearing to address Lively’s prospective request for a gag order, originally scheduled for February 12, has been moved up to February 3. The legal drama surrounding the film adaptation of Colleen Hoover’s It Ends With Us is drawing comparisons to other high-profile celebrity trials. Legal experts speculate the case may settle before reaching court, given that over 90% of civil cases do not proceed to trial. However, with accusations and counterclaims continuing to escalate, this high-profile legal clash is expected to remain a focal point for both fans and media outlets in the months leading up to the trial.   COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/blake-justin1734950159-0/blake-justin1734950159-0.jpg", "path": "full/8ecd1523da996ec35f7c058dae97b0ff078bfe9e.jpg", "checksum": "e4782d52a24e931aa83b5b9cde8cc662", "status": "downloaded"}]},
{"title": "Snoop Dogg loses over half a million followers after performing at Trump’s Crypto Ball", "detail_url": "https://tribune.com.pk/story/2524979/snoop-dogg-loses-over-half-a-million-followers-after-performing-at-trumps-crypto-ball", "image_urls": ["https://i.tribune.com.pk/media/images/snoop1737461809-0/snoop1737461809-0.png"], "catagory": "Pop Culture & Art", "content": "Rapper Snoop Dogg has faced significant backlash after performing at Donald Trump’s inaugural Crypto Ball, leading to a loss of over half a million social media followers.  According to analytics reports, Snoop’s Instagram followers dropped by 571,800, and his X (formerly Twitter) account saw a decline of 17,177 followers. The backlash stems from fans accusing the “Gin and Juice” hitmaker of hypocrisy due to his previous criticism of Trump. Social media users expressed disappointment, with many stating they could no longer support him. One fan wrote, “Gotta unfollow anyone that performs for Trump. Love Snoop Dogg, but this is too much.” Snoop addressed the controversy during an Instagram Live session, saying, “Y’all can’t hate enough on me. I love too much… Still a Black man, still 100 percent Black.” He also highlighted Trump’s clemency for Michael “Harry O” Harris, co-founder of Death Row Records, as a reason for his softened stance. This is not the first time entertainers have faced backlash for associating with Trump. Reality star Kim Kardashian recently lost nearly 150,000 followers after posting a photo of Melania Trump at the inauguration, and other performers, including Carrie Underwood, were also criticized for participating in related events. Despite the uproar, Snoop Dogg has maintained his position, emphasizing a desire to separate professional engagements from political affiliations. The rapper remains one of the most influential figures in the music industry, but the controversy has ignited debates about entertainers' political involvement and its impact on their fan base. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/snoop1737461809-0/snoop1737461809-0.png", "path": "full/6a645c457b079bc62b622de7571de392b45f233b.jpg", "checksum": "3a766e4e1402620d5b1caec694c78d41", "status": "downloaded"}]},
{"title": "Ohio police officer arrested for secretly filming teenage girl with hidden bathroom camera", "detail_url": "https://tribune.com.pk/story/2524980/ohio-police-officer-arrested-for-secretly-filming-teenage-girl-with-hidden-bathroom-camera", "image_urls": ["https://i.tribune.com.pk/media/images/eric-11738022913-0/eric-11738022913-0.png"], "catagory": "Pop Culture & Art", "content": "An Ohio police officer has been arrested and charged with voyeurism and tampering with evidence after allegedly using a hidden camera to film a teenage girl in a bathroom. Eric Gregory, 45, a former officer with the Harrison Police Department, is accused of hiding the camera inside a home on Elm Street, according to court documents. When the camera was discovered, Gregory reportedly destroyed the SD card by cutting it up, flushing it down the toilet, and smashing the camera to conceal evidence. The Miami Township Police Department, in collaboration with the Clermont County Prosecutor's Office, filed criminal charges following a complaint involving a juvenile victim. Gregory was arrested and booked into the Clermont County Jail with bond set at $250,000. Initially placed on paid administrative leave, Gregory resigned from the Harrison Police Department shortly after the investigation began. The case is set to be presented to the Clermont County Grand Jury on Thursday, January 30. Authorities are urging anyone with additional information regarding Gregory or related offenses to contact the Miami Township Police investigative division at 513-248-3721. The incident has drawn significant public attention, emphasizing the ongoing need for accountability and stringent oversight in law enforcement. Gregory now faces severe legal consequences if found guilty of these charges. This case serves as a reminder of the importance of reporting suspicious activity and ensuring justice for victims of such invasive crimes. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/eric-11738022913-0/eric-11738022913-0.png", "path": "full/d266241834bd1660d480309f59e5de7392660a6b.jpg", "checksum": "7dd5ef45b29134c036d0da19e14d226a", "status": "downloaded"}]},
{"title": "Store, firm fined for 'counterfeit' drug sales", "detail_url": "https://tribune.com.pk/story/2524927/store-firm-fined-for-counterfeit-drug-sales", "image_urls": ["https://i.tribune.com.pk/media/images/Tribune-Logo1722036490-0/Tribune-Logo1722036490-0.jpeg"], "catagory": "APP", "content": "The Haripur Consumer Protection Court, on Monday, imposed fines on a medical store and the owners of a pharmaceutical company for selling substandard and counterfeit medicines. Complainants Akhtar Nawaz and Muhammad Arslan reported that they were sold a liquid gel that was supposed to be in gel form but was found to be in liquid form. They also noted several discrepancies in the product's labelling, including mismatched product names and missing manufacturer details. The complainants raised concerns that the medicines were of poor quality and potentially counterfeit. Following an inspection, the Consumer Protection Council of Peshawar confirmed the labelling errors and quality issues. The complainants provided consistent testimony that supported their allegations. The defendants acknowledged purchasing the gel from a registered company but admitted they failed to verify its quality before selling it. The court held the defendants accountable under the Khyber Pakhtunkhwa Consumer Protection Act of 1997, imposing a fine of Rs20,000 on Khurshid Medicos. Each defendant was also ordered to pay Rs10,000 as compensation to the complainants. The manufacturing company was fined Rs50,000 for violating labelling requirements. The court further directed authorities to conduct immediate inspections of stores suspected of selling counterfeit medicines and recommended legal actions against such stores. Additionally, it called for awareness campaigns to educate consumers on identifying counterfeit medicines and distinguishing legitimate sellers COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/Tribune-Logo1722036490-0/Tribune-Logo1722036490-0.jpeg", "path": "full/40b1d9ff3a1581f96c69647eafaae447076305ed.jpg", "checksum": "7016fb04c026f327298df44f44b51c9a", "status": "downloaded"}]},
{"title": "Murree forest fires continue to rage, burn 3 homes", "detail_url": "https://tribune.com.pk/story/2524928/murree-forest-fires-continue-to-rage-burn-3-homes", "image_urls": ["https://i.tribune.com.pk/media/images/21654893302-1/21654893302-1.jpg"], "catagory": "Our Correspondent", "content": "Forest fires are ravaging the forests of Murree and Galyat, with three homes reduced to ashes. Countless trees, shrubs and wildlife in the forests are also being consumed by the flames. According to locals, the forests of the hilly areas are at greater risk. If the Punjab and Khyber Pakhtunkhwa governments do not take the forest fires seriously, the future of these renowned tourist destinations could be at risk, they said. The fire's smoke is visible in the daytime, with flames rising at night. The lives of animals, birds, and wildlife are also in danger. In the village of Nambley Maira Cham in Galyat, two houses were destroyed by fire, while one home in the Mallot Sattian area of Murree district was also reduced to ashes. Meanwhile, the Murree district administration, along with the TDCP, has organised a consultation meeting with the local community at the Patriata chairlift parking at 10am today. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/21654893302-1/21654893302-1.jpg", "path": "full/9aab337997bccdf5e9b93edb4a7370e0d834d2d3.jpg", "checksum": "4eaba403c36aa22a85f37ac83aec9bfd", "status": "downloaded"}]},
{"title": "Ryan Reynolds faces heat for improvised slap to child actor in 2005 film", "detail_url": "https://tribune.com.pk/story/2524982/ryan-reynolds-faces-heat-for-improvised-slap-to-child-actor-in-2005-film", "image_urls": ["https://i.tribune.com.pk/media/images/ryan1738027749-0/ryan1738027749-0.png"], "catagory": "Pop Culture & Art", "content": "Ryan Reynolds is facing criticism after a clip from his 2005 film The Amityville Horror resurfaced, showing the actor improvising a slap to then-15-year-old child actor Jesse James.  The unscripted moment, which occurred during a tense scene, has sparked a debate over on-set boundaries and ethical filmmaking practices. In the scene, Reynolds, portraying a father possessed by a malevolent force, strikes James, who appeared visibly surprised. The slap was not part of the script and was improvised to enhance the realism of the performance. In a 2005 interview with Radio Free, Reynolds described the moment as \"disturbing\" but added that James found the experience \"cool.\" He also noted that the film’s script supervisor was deeply upset by the incident. The clip, widely circulated on social media, has reignited discussions about the treatment of child actors in Hollywood. Critics have called the improvisation \"inappropriate,\" with some labeling it as \"abuse,\" while others defended Reynolds, arguing the act contributed to the intensity of the scene. This controversy comes at a sensitive time for Reynolds, whose wife, Blake Lively, is currently embroiled in a $400 million defamation lawsuit involving her It Ends With Us director, Justin Baldoni. Reynolds has not yet commented on the backlash surrounding the resurfaced clip. As debates around on-set ethics and creative liberties continue, this incident highlights the ongoing scrutiny faced by actors in the entertainment industry. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/ryan1738027749-0/ryan1738027749-0.png", "path": "full/f6e74f7c780223b1af7d4a77d80d2ea151d21c2b.jpg", "checksum": "bfaf3dc43e0459ab07617309f0717048", "status": "downloaded"}]},
{"title": "Bob Dylan announces 2025 ‘Rough And Rowdy Ways’ tour dates, tickets on sale soon", "detail_url": "https://tribune.com.pk/story/2525020/bob-dylan-announces-2025-rough-and-rowdy-ways-tour-dates-tickets-on-sale-soon", "image_urls": ["https://i.tribune.com.pk/media/images/bob-dylan1738050661-0/bob-dylan1738050661-0.jpg"], "catagory": "Pop Culture & Art", "content": "Bob Dylan has unveiled the first dates for his 2025 tour—check out the list of scheduled performances below. Over the weekend, Dylan announced one concert in Tulsa, Oklahoma, scheduled for March 25, via social media. On January 27, he added three more shows in smaller cities, including Wichita, Green Bay, and Mankato. The Wichita concert is set for March 29 at the Century II Concert Hall, followed by performances in Mankato on April 4 and Green Bay on April 6. These shows are part of Dylan's ongoing Rough And Rowdy Ways tour, which began in 2021. Tickets for Dylan’s Tulsa concert are already on sale, while tickets for the Wichita and Green Bay shows will be available starting January 31. Tickets for the Mankato performance will go on sale on February 1. You can purchase tickets for all shows here. Bob Dylan’s 2025 Rough And Rowdy Ways tour dates are:   \nMARCH   \n25 – Tulsa, OK – Tulsa Theater   \n29 – Wichita, KS – Century II Concert Hall   APRIL \n04 – Mankato, MN – Mayo Clinic Health Systems Event Center   \n06 – Green Bay, WI – The Weidner-Cofrin Family Hall   The announcement of these new tour dates follows the release of Dylan’s acclaimed biopic, A Complete Unknown, starring Timothée Chalamet. The film has received multiple Oscar nominations, including Best Picture. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/bob-dylan1738050661-0/bob-dylan1738050661-0.jpg", "path": "full/8407f4be993a1be1f738fbd7ae881f1e50d032cb.jpg", "checksum": "3ec6197bd2e8cd2a7374b9999db207b2", "status": "downloaded"}]},
{"title": "Four sentenced to death over 'online blasphemy'", "detail_url": "https://tribune.com.pk/story/2524962/four-sentenced-to-death-over-online-blasphemy", "image_urls": ["https://i.tribune.com.pk/media/images/371738018533-7/371738018533-7.jpg"], "catagory": "Afp", "content": "A court in Rawalpindi sentenced four men to death for posting blasphemous content online, a prosecution lawyer told AFP on Monday. \"They were sentenced to death  on Friday for spreading blasphemous content online,\" Rao Abdur Raheem, a lawyer from the Legal Commission on Blasphemy Pakistan, a private group which brought the case to court, told AFP. \"Our case was supported by forensic evidence from the devices used in this heinous act,\" he added. A member of a support group formed by the families confirmed the sentence to AFP and said the group would challenge the conviction. AFP COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/371738018533-7/371738018533-7.jpg", "path": "full/8a237d0ca82a8a21136da863054bfa0e9c640639.jpg", "checksum": "7463d0b189cac32d730cf2a838526031", "status": "downloaded"}]},
{"title": "'Jobless' Jimmy Butler trolls Miami Heat after being suspended for third time", "detail_url": "https://tribune.com.pk/story/2525019/jobless-jimmy-butler-trolls-miami-heat-after-being-suspended-for-third-time", "image_urls": ["https://i.tribune.com.pk/media/images/aitools-401738051469-0/aitools-401738051469-0.png"], "catagory": "Sports Desk", "content": "Jimmy Butler took to Instagram to poke fun at his latest suspension by the Miami Heat. This marks the third suspension for the 35-year-old this month. Butler had just returned from a two-game suspension for missing a team flight and previously served a seven-game ban for repeated conduct issues. Before the game against Orlando Magic, Miami Heat indefinitely suspended forward Butler on Monday after he walked out of a practice session. It was reportedly in response to being told he would come off the bench. In a statement posted on X, the Heat confirmed the suspension, citing a \"continued pattern of disregard for team rules, conduct detrimental to the team, and intentionally withholding services.\" The team added that the ban would last no fewer than five games. Butler, a six-time All-Star in his 15th NBA season, played a pivotal role in leading the Heat to the NBA Finals in 2020 and 2023, losing to the Los Angeles Lakers and Denver Nuggets, respectively. However, tensions between Butler and the team have escalated, with the player openly requesting a trade earlier in the season. Initially hesitant, the Heat has since indicated a willingness to consider offers for Butler ahead of the NBA’s mid-season trade deadline on February 6. The suspension will last through the deadline, with the team reassessing its stance if Butler remains on the roster. Teammate Tyler Herro acknowledged the ongoing uncertainty. “It kind of feels normal now at this point. Nothing is guaranteed, so we just have to roll with whatever cards we’re dealt,” Herro said. As of now, the Heat sits eighth in the Eastern Conference standings, with its playoff hopes hanging in the balance. Miami Heat fans have had a mixed reaction to Jimmy's third suspension, with some criticising Butler's actions while others praising his supposed 'trolling skills.' \n COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/aitools-401738051469-0/aitools-401738051469-0.png", "path": "full/593c8cde7b4603124e4070159132124cf83bffa5.jpg", "checksum": "1130bde2dd86b126df78c8f031d4387c", "status": "downloaded"}]},
{"title": "VPN, AI users warned of personal data hacking", "detail_url": "https://tribune.com.pk/story/2524961/vpn-ai-users-warned-of-personal-data-hacking", "image_urls": ["https://i.tribune.com.pk/media/images/381738018534-8/381738018534-8.jpg"], "catagory": "Our Correspondent", "content": "The National Telecom and Information Technology Security Board (NTISB) has issued cyber security advisory against hacking of personal data. Sources said the advisory has mentioned Chat GPT 4, Gemini for Chrome and other more than one dozen applications and website that were being targeted by hackers to obtain personal information. The advisory has warned the VPN and AI driven tools users of the threats posed by the hackers who insert codes in the browsers extensions to get an access to personal information of the consumers. The security board has identified 16 applications in this regard. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/381738018534-8/381738018534-8.jpg", "path": "full/9768303f1a289501248b42d1f91cf4af82688798.jpg", "checksum": "1ee63cc89cc56bc2cf510774e7a9a147", "status": "downloaded"}]},
{"title": "At Senate panel, FBR defends Rs6b vehicle purchase", "detail_url": "https://tribune.com.pk/story/2524963/at-senate-panelfbr-defends-rs6b-vehicle-purchase", "image_urls": ["https://i.tribune.com.pk/media/images/391738018533-9/391738018533-9.jpg"], "catagory": "Our Correspondent", "content": "The Federal Board of Revenue (FBR) has submitted a letter to the Senate Standing Committee on Finance and Revenue, clarifying its stance on the procurement of new vehicles for its staff. The letter states that the vehicles will only be allocated to Grade 17 and 18 officers working in field offices and engaged in field operations. Officers in Grade 19 and above will not be provided vehicles under this arrangement. The vehicles will be assigned to offices rather than individuals to prevent misuse, it added. To further ensure transparency, the FBR plans to place official stickers on the vehicles to curb unauthorised use. The letter also specifies that the vehicles will be procured locally from manufacturers or their authorised agents, in compliance with the law. \"Out of approximately 260,000 manufacturers who should be paying sales tax, only 42,000 are registered with the FBR and even those that are registered are also not fully compliant\". The FBR said that sugar factories were often situated in remote areas, and hundreds of officials were deployed to monitor sugar production in locations without public transportation. It noted that the previous practice of relying on sugar mill owners for commuting arrangements had undermined the officials' integrity. Regarding the economic challenges currently facing the country, the FBR noted that foreign debt repayments have reached unprecedented levels. The letter added that sustained economic recovery depends on achieving revenue collection targets, with the FBR working on a war footing to meet the target of Rs1,300 billion in tax collections. The tax body further noted that the staff needed to be mobile and active in the field to ensure tax recovery, adding that in the previous fiscal year, the FBR faced a tax gap of Rs600 billion, including a shortfall of Rs350 billion in sales tax collections. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/391738018533-9/391738018533-9.jpg", "path": "full/f2cb19bff43123c0963bda863a5de5c42b0e5232.jpg", "checksum": "57cccc89532622081b6e0a9edc833099", "status": "downloaded"}]},
{"title": "PM assures ease of doing business", "detail_url": "https://tribune.com.pk/story/2524964/pm-assures-ease-of-doing-business", "image_urls": ["https://i.tribune.com.pk/media/images/124959661717363454201736350886-0/124959661717363454201736350886-0.jpg"], "catagory": "Our Correspondent", "content": "Prime Minister Shehbaz Sharif reaffirmed the government's commitment to fostering economic stability, promoting commerce, ensuring Pakistan's resurgence as a progressive and thriving nation, and assured that efforts were afoot to ensure ease of doing business in the country. Addressing the inauguration ceremony of a six-star hotel in the federal capital, Shehbaz expressed optimism about the economic revival and reiterated the government's commitment to fostering progress across various sectors. He highlighted the government's efforts to stabilise the economy. He outlined the government's vision for economic development in agriculture, industry, IT, mining, and minerals. \"A competitive industrial sector is essential for economic growth, and we are committed to easing the cost of doing business,\" he said. Announcing a new initiative for the privatisation of the PIA, he invited Pakistani investors to participate in a transparent bidding process. Separately, chairing a meeting on the Railways, Shehbaz directed the Pakistan Railways to collaborate with the private sector for the use of its land for business purposes and provide competitive and modern facilities to attract the passengers. The prime minister also directed the department to formulate a comprehensive strategy to increase trade with the region, especially the Central Asian countries. He asked the Railways to replace the old system with modern technology. Also, the PM chaired the first meeting of the task force on combating human trafficking. The prime minister directed for the issuance of 'Red Warrants' against those found guilty of human trafficking. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/124959661717363454201736350886-0/124959661717363454201736350886-0.jpg", "path": "full/fcd65d5b16de0cb12cadc26ea947e14ec7ee0698.jpg", "checksum": "a1405cd7af538bb37df69be1a6c9b5ba", "status": "downloaded"}]},
{"title": "Female entrepreneurs shape digital marketplace", "detail_url": "https://tribune.com.pk/story/2524922/female-entrepreneurs-shape-digital-marketplace", "image_urls": ["https://i.tribune.com.pk/media/images/Tribune-Logo1722036490-0/Tribune-Logo1722036490-0.jpeg"], "catagory": "APP", "content": "In the ever-evolving world of e-commerce, a new generation of women online entrepreneurs is becoming increasingly prominent, marking a significant shift in the digital landscape. With the internet as their catalyst, numerous women have embarked on careers in online entrepreneurship and transforming their passions into successful businesses, empowering others to pursue their entrepreneurial dreams.\" A successful online entrepreneur Saman Taha recently shared her inspiring journey and said, \"I never imagined I could turn my passion into a career, but the internet has opened doors for women like me to build businesses and reach a global audience.\" \"As an online clothing entrepreneur, I earn a handsome profit and enjoy the flexibility. I am grateful to be part of the online business revolution, which is empowering countless individuals like me\", she added. \"Another successful online entrepreneur Samra Jabeen, who has built a thriving business selling makeup accessories, shared her inspiring story and said that with a massive following and significant earnings, she has proof that online entrepreneurship can be a lucrative and fulfilling career path COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/Tribune-Logo1722036490-0/Tribune-Logo1722036490-0.jpeg", "path": "full/40b1d9ff3a1581f96c69647eafaae447076305ed.jpg", "checksum": "7016fb04c026f327298df44f44b51c9a", "status": "downloaded"}]},
{"title": "University campus to be inaugurated in Chiniot", "detail_url": "https://tribune.com.pk/story/2524915/university-campus-to-be-inaugurated-in-chiniot", "image_urls": ["https://i.tribune.com.pk/media/images/1094852-Untitled-1462047227/1094852-Untitled-1462047227.jpg"], "catagory": "APP", "content": "Federal Minister for Maritime Affairs Qaiser Ahmed Sheikh has announced the upcoming inauguration of a new campus of GC University Chiniot, a project worth Rs2 billion, which aims to provide higher education opportunities to local students. He was addressing an open court in Chiniot to address public issues, where citizens raised concerns regarding cleanliness, health, electricity, gas, and other basic facilities. The minister issued directives to the concerned departments to resolve these issues promptly and assured the public that all complaints would be addressed on a priority basis. He said he would bear the educational expenses of deserving students. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/1094852-Untitled-1462047227/1094852-Untitled-1462047227.jpg", "path": "full/9aa3a440cb819bdc36df49b04aa701434e02556b.jpg", "checksum": "e6f64f20727721bc595a3ef00c637ffd", "status": "downloaded"}]},
{"title": "Festival celebrates Taxila's cultural heritage", "detail_url": "https://tribune.com.pk/story/2524925/festival-celebrates-taxilas-cultural-heritage", "image_urls": ["https://i.tribune.com.pk/media/images/Taxila-heritage-artefacts-(3)1716751010-1/Taxila-heritage-artefacts-(3)1716751010-1.jpeg"], "catagory": "Our Correspondent", "content": "The third edition of the Citrus Festival kicked off in Taxila, blending agriculture, art, and culture to spotlight the region's rich agricultural heritage and the pressing challenges faced by citrus farmers. The event, organised by the Gandhara Resource Centre Pakistan (GRCP), was launched by Team Leader Sarah Mehmood, who welcomed participants from various sectors to celebrate the festival's growing success since its inception in 2023. In her opening speech, Mehmood highlighted that the festival, originally launched by Nadeem Omar Tarar, Executive Director of the Center for Culture and Development (C2D), has become a cornerstone of Taxila's agricultural and cultural identity. \"The Taxila and Gandhara heritage, along with the agricultural legacy of Haripur, are key pillars of our identity,\" said Mehmood. \"This festival not only celebrates the citrus industry but also brings attention to the challenges farmers face today.\" A central theme of the festival was the preservation of Taxila's heritage, particularly its citrus farming, which has long been a vital part of the region. Haripur, once known for its extensive citrus orchards, now faces growing threats from expanding housing societies. This year's festival aimed to raise awareness about the ecological importance of preserving these farmlands. The event also provided a platform for farmers to discuss key issues such as water scarcity, poor crop yields, and market access. Chief Guest Yousaf Ayub Khan, former Member of the Provincial Assembly of Khyber-Pakhtunkhwa, commended the festival's role in preserving agricultural heritage while condemning the encroachment of housing societies on farmland. Khan also referenced the work of British Army officer Col Wacefield, who introduced citrus farming to the region in the 1930s, and called for stronger policies to protect agricultural land from real estate development. Dr Waseem, an expert in citrus cultivation, shared insights into the industry's growth, noting that citrus is now a major export product, particularly to the Middle East. However, he emphasised challenges like reduced water supply during peak months and the impact of chemical fertilisers on fruit quality. \"We are developing a state-of-the-art nursery with 10 citrus varieties to sustain our orchards and focus on value-added initiatives to help farmers maximize their yields,\" Dr Waseem explained. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/Taxila-heritage-artefacts-(3)1716751010-1/Taxila-heritage-artefacts-(3)1716751010-1.jpeg", "path": "full/e2cc5dc0837934a8fcabd959c4002e9360ec3579.jpg", "checksum": "47b62cdea6554803a32cd1fac1447330", "status": "downloaded"}]},
{"title": "A scenic journey with historical insights", "detail_url": "https://tribune.com.pk/story/2524926/a-scenic-journey-with-historical-insights", "image_urls": ["https://i.tribune.com.pk/media/images/790752-Tourism-1415910501/790752-Tourism-1415910501.JPG"], "catagory": "Waqar Ali Azam", "content": "The Safari Train, a collaborative initiative by the Tourism Department and the Pakistan Railways, operates every Sunday, offering a unique travel experience that combines breathtaking scenery and historical exploration. The train runs from Rawalpindi to Attock Khurd, taking passengers on a memorable journey through some of Pakistan's most picturesque landscapes and culturally rich sites. A key highlight of this journey is the stop at the historic Hassan Abdal Railway Station, which holds immense historical significance. Built during the British colonial era in the late 19th century, this architectural marvel stands as a testament to the engineering and design of that time. Its vintage charm, arched windows, and intricate brickwork reflect the legacy of a bygone era. Situated near the famous Gurdwara Panja Sahib and the ancient Grand Trunk Road, the station is a gateway to the region's cultural and historical treasures. Passengers are welcomed at Hassan Abdal with traditional \"dhol\" performances, making the stop a festive and enriching experience. Visitors can explore the station's heritage while enjoying the hospitality and cultural vibrancy of the region. The train draws a diverse crowd, including families, children, and school groups. Many travellers have praised the initiative for its educational and recreational value. Maria Khan, a teacher accompanying her students, says the weekly Safari Train is an excellent way to expose children to Pakistan's heritage in an enjoyable and interactive manner. Ahmed Raza, a frequent traveller, says every Sunday, this train brings people closer to nature and history. \"The stop at Hassan Abdal Railway Station is always the highlight of his trip. It's like stepping back in time.\" By running every Sunday, the Safari Train has become a popular family outing and a means to promote domestic tourism. It not only showcases Pakistan's natural and cultural beauty but also preserves and celebrates its historical landmarks. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/790752-Tourism-1415910501/790752-Tourism-1415910501.JPG", "path": "full/5fb7912787117ecc83138866ba88b9407a670ce2.jpg", "checksum": "14c24cb60756ab4c07609d1092788f1e", "status": "downloaded"}]},
{"title": "Cold weather drives up dry fruits demand", "detail_url": "https://tribune.com.pk/story/2524924/cold-weather-drives-up-dry-fruits-demand", "image_urls": ["https://i.tribune.com.pk/media/images/1544101-image-1509217115/1544101-image-1509217115.jpg"], "catagory": "APP", "content": "The demand for dry fruits has surged in the federal capital as the winter season continues to become cooler with each passing day. Some people use dry fruits in dishes specially prepared in the winter season, like 'Gajar ka Halwa' (a sweet dish made of carrots), sohan halwa (a sweet made with all-purpose flour, milk and dry fruits) etc. Bakeries and sweet shops also incorporate dry fruits in sweets to make them tasty and healthy. Regardless of price, the demand for dry fruits was at its peak as a rush of customers was spotted at several dry fruit shops. A dry fruit seller, Pervaiz Khan, said, \"The demand for dry fruit is at its peak\" because people love to eat them in winter, and it also reduces the effect of cold air on the body. He also said that as compared to last year, the prices of most items have increased due to an increase in the prices of services used for the cultivation of dry fruit and also to reach the end users, like transport, labour, etc. On inquiry of prices, the shopkeeper said that prices of dry fruits vary depending on quality and origin. As almonds range from Rs4,800 to Rs5,600 per kg, while walnuts cost Rs1400-1,800 per kg, Khan said adding that cashews, figs, and pine nuts are priced at roundabout Rs3,600, Rs4,000, and Rs14,000 per kg, respectively. He specifically called peanuts the most affordable and best-selling product whose prices depend on the type of area where they were produced. He said peanuts were produced in mainly three regions of the country including Parachinar, Chakwal, and Gujjar Khan, with prices of Rs1200, Rs720, and Rs640 per kg, respectively. A customer, Muhammad Ahmed, said that winter was the best season to consume these dry fruits as they gave enough energy and also reduced the effect of the cold weather. A female customer said, \"I want to purchase these dry fruits so that I can use them in deserts, taste and health perspective. The sale of sweets in which these dry fruits were used was also enhanced due to the effect of the season. The online sale of dry fruits has also seen a boost, with e-commerce platforms offering competitive prices. However, some online sellers face challenges with cancelled orders and increased costs. An online store owner said, \"Online selling of dry fruits is very appealing during winter.\" Adding, \"We offer very affordable and competitive prices.\" \"Most customers order online but when goods reach the addresses people usually cancel the order which raises the cost of the goods,\" the owner added. The supply of dry fruits involves sourcing from various regions, including Gilgit-Baltistan, Balochistan, and Punjab. Suppliers have reported increased costs due to transportation and farming expenses reason behind the rise in the prices of dry fruit. Supplier of dry fruit from Gilgit Baltistan, Wazir Hashmat told APP that he supplied dry fruit items from all parts of the country and sent them to Lahore, where the main market of dry fruits exists. He also said that prices of dry fruit items increased at farmers' end while other costs associated with transportation also enhanced its value. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/1544101-image-1509217115/1544101-image-1509217115.jpg", "path": "full/21c26e17801d725367821f487ebe3d7334a5b132.jpg", "checksum": "bf3bab8ff837df66f45949961123edf6", "status": "downloaded"}]},
{"title": "One dead in shootout over cockfight deal", "detail_url": "https://tribune.com.pk/story/2524930/one-dead-in-shootout-over-cockfight-deal", "image_urls": ["https://i.tribune.com.pk/media/images/988678-cockfightafp-1447150182/988678-cockfightafp-1447150182.jpg"], "catagory": "Our Correspondent", "content": "Dispute over a cockfight resulted in a gunfight that left one person dead and another injured. Keamari district SSP said that the shooting incident was related to a dispute over money transactions in the Metroville area of SITE. Quoting initial investigations, the SSP said that a chicken shop owner, Zafar, used to organise illegal cockfights in the area. Meanwhile, a photocopy shop owner Fajar Babu also started holding bouts. Both the men were running gambling rackets on cockfights. However, a monetary dispute occurred between the two and Zafar kidnapped Fajar's brother. Fajar went to Zafar's den to resolve the issue, however a heated argument occurred and soon everyone stopped talking and started shooting. When the gun smoke cleared, one of Zafar's men, Usman Ghani and Fajar were lying on the ground and all others had escaped. Fajar died during treatment at Civil Hospital. Police were conducting raids to catch Zafar. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/988678-cockfightafp-1447150182/988678-cockfightafp-1447150182.jpg", "path": "full/b25cc01fa59fb480adb87228d7e0590e043f337d.jpg", "checksum": "22f6152cb0e473fd9f33cdb983d894ea", "status": "downloaded"}]},
{"title": "Major Peshawar uplift nears completion", "detail_url": "https://tribune.com.pk/story/2524916/major-peshawar-uplift-nears-completion", "image_urls": ["https://i.tribune.com.pk/media/images/2716718-cmgandapur-1727882018-917-640x4801727885953-0/2716718-cmgandapur-1727882018-917-640x4801727885953-0.jpg"], "catagory": "Our Correspondent", "content": "All development projects under Phase 2 of the Peshawar Uplift Program, including the jogging and cycling track in the Hayatabad area of Peshawar, have entered their final stages. The projects will be inaugurated by the K-P chief minister. Chief Minister Ali Amin Gandapur, under his public agenda, aims to enhance the beauty of the provincial capital, Peshawar, and provide facilities to the public. All development projects under the Peshawar Uplift Program Phase 2, including the Hayatabad jogging and cycling track, are nearing completion. The chief minister will inaugurate all projects next month. To promote healthy activities, the Hayatabad jogging and cycling track will be opened to the public immediately after the inauguration. Under Phase 2 of the Peshawar Uplift Program, several development projects have already been completed in the historic University of Peshawar. Additionally, projects include the construction and renovation of Peshawar Zoo (Palosi) Road. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/2716718-cmgandapur-1727882018-917-640x4801727885953-0/2716718-cmgandapur-1727882018-917-640x4801727885953-0.jpg", "path": "full/8c8fb7910d82c656c50d95ab3fadbb9acde482d2.jpg", "checksum": "8f4ca1547edc970c9a0b8dee3b0045b8", "status": "downloaded"}]},
{"title": "Moving SHC by Chinese nationals 'against protocol': minister", "detail_url": "https://tribune.com.pk/story/2524929/moving-shc-by-chinese-nationals-against-protocol-minister", "image_urls": ["https://i.tribune.com.pk/media/images/SindhhomeministerLanjar-sindhpolice-express1727360111-0/SindhhomeministerLanjar-sindhpolice-express1727360111-0.jpg"], "catagory": "Our Correspondent", "content": "Sindh Home Minister Ziaul Hassan Lanjar has expressed displeasure over a recent petition filed by a group of Chinese nationals in the Sindh High Court (SHC) regarding alleged police harassment and restrictions on their movement, calling it \"against protocol.\" The petition was submitted by six Chinese nationals, represented by their lawyer Peer Rehman Mehsud, who argued that they, along with thousands of other Chinese citizens, had entered Pakistan legally, made huge investments in various sectors, and followed all necessary procedures. The petitioners claimed that, over the past six to seven months, the Sindh police had repeatedly harassed them, including unjustly restricting their movements in Karachi and throughout Sindh. They also alleged that they were subjected to arbitrary detentions in their homes under the guise of \"security concerns,\" despite a lack of clear legal justification or any specific incidents to warrant such actions. Subsequently, the SHC's constitutional bench issued notices to the foreign ministry and other concerned parties, while the Sindh government launched an inquiry into the allegations. Speaking to the media outside the Sindh Assembly on Monday, Home Minister Lanjar criticised the petition, stating that it was \"against the protocols.\" He suggested that the petitioners should approach the provincial government through the Chinese Consul General or Pakistan's Foreign Office. The home minister claimed that the petitioners were in Pakistan in a private capacity and did not have any formal investments in the country. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/SindhhomeministerLanjar-sindhpolice-express1727360111-0/SindhhomeministerLanjar-sindhpolice-express1727360111-0.jpg", "path": "full/4338f1d3b3d584d6cfd45c03e151280674ac040b.jpg", "checksum": "15e9423ff7fde36456f85295f9305c99", "status": "downloaded"}]},
{"title": "'Spring Plantation Drive' to begin on Feb 15", "detail_url": "https://tribune.com.pk/story/2524923/spring-plantation-drive-to-begin-on-feb-15", "image_urls": ["https://i.tribune.com.pk/media/images/Plantation1723675184-4/Plantation1723675184-4.jpg"], "catagory": "Our Correspondent", "content": "The Forest Department has finalised arrangements to plant a record one million saplings in the Rawalpindi division during the Spring Plantation Drive, set to begin on February 15. Prime Minister Shahbaz Sharif and Chief Minister Maryam Nawaz will officially inaugurate the campaign in Lahore. The department has completed the preparation of saplings in its nurseries for plantation. Plant delivery and distribution will start on February 5. Plants will be provided free of charge to all government institutions, including the armed forces, while plants will be provided to private sectors for up to Rs10 From February 10. Special plantation stalls will be set up in central roundabouts across the city by the forest department. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/Plantation1723675184-4/Plantation1723675184-4.jpg", "path": "full/4cd8a46dc1a13d24791ac7dbb1e696d5b1685568.jpg", "checksum": "a9d7109f7a7bae41bc0ee14a7e141011", "status": "downloaded"}]},
{"title": "Agriculture tax bill sails through assembly", "detail_url": "https://tribune.com.pk/story/2524917/agriculture-tax-bill-sails-through-assembly", "image_urls": ["https://i.tribune.com.pk/media/images/754076-PakistanTaxcopy-1409089278/754076-PakistanTaxcopy-1409089278.jpg"], "catagory": "Shahida Parveen", "content": "The Khyber-Pakhtunkhwa Assembly approved crucial bills during Monday's session, including one to implement agriculture tax across the province, and another to dismiss government employees hired during the last caretaker regime. The assembly also approved a bill to establish a new regulatory force similar to the police, sending it to the Select Committee. The committee will be headed by Chief Minister Sardar Ali Amin Gandapur and will include members like Mushtaq Ghani, Munir Hussain, Asif Khan, Ahmad Kundi, Arbab Usman, Idrees Khan, Sheer Ali, and Adnan Khan. The committee was instructed to review the bill and submit a report within four days. The session on Monday was chaired by K-P Assembly Speaker Babar Azam Swati. Agriculture tax The Khyber-Pakhtunkhwa Assembly passed the bill to impose agricultural income tax. The Khyber-Pakhtunkhwa Agricultural Income Tax Bill 2025 stipulates that a 15% tax will apply on annual agricultural income between Rs0.6 million and Rs1.2 million, 20% tax on income between Rs1.2 million and Rs1.6 million, and 30% on income between Rs1.6million and 3.2million. Agricultural income above Rs5.6 million will be taxed at 45%. A super tax will apply to individuals earning more than Rs150 million, annually , from agriculture. Those who own more than one land will be required to submit location details. A tax will also apply to those with 50 acres or more of cultivated land, or 100 acres or more of uncultivated land. Dismissing govt employees As for the bill to dismiss employees hired during the caretaker government, relevant departments will issue notifications for the dismissal of employees, and a technical committee, headed by the establishment secretary, will be formed to resolve any legal issues or complications. The Khyber-Pakhtunkhwa Employees (Dismissal from Service) Bill 2025 will apply to appointments made between January 22, 2023, and February 29, 2024. However, employees hired under the Public Service Commission, minority and special quotas, or those appointed based on judicial orders and through proper tests and interviews, will be exempted. During the session, Law Minister Aftab Alam presented a motion for the dismissal of employees hired during the caretaker period, citing that the Election Act of 2017 clearly specifies the role of the caretaker government, and the mandate for hiring lies with the elected government. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/754076-PakistanTaxcopy-1409089278/754076-PakistanTaxcopy-1409089278.jpg", "path": "full/b84f0e662decd4a0d97a84432ceb9da2c303d6f5.jpg", "checksum": "8b3e5db4b9624916feef82dfd4865981", "status": "downloaded"}]},
{"title": "Kundi slams CM's Islamabad huddle", "detail_url": "https://tribune.com.pk/story/2524918/kundi-slams-cms-islamabad-huddle", "image_urls": ["https://i.tribune.com.pk/media/images/Untitled-design-(5)1724919650-0/Untitled-design-(5)1724919650-0.png"], "catagory": "Our Correspondent", "content": "Khyber-Pakhtunkhwa Governor Khyber-Pakhtunkhwa Faisal Karim Kundi strongly criticised the consultative meeting hosted by CM Ali Amin Gandapur, calling it completely undemocratic and biased. He stated that inviting only specific parties to this meeting is a failed attempt to divide the nation. The governor questioned why, when an All-Parties Conference was called on a critical issue like terrorism, all stakeholders in the province were invited to formulate a joint strategy? However, in this meeting, major and important political parties were ignored, limiting it to certain ideologies, which is deeply regrettable. Faisal Karim Kundi further stated that this meeting should have been held in Peshawar to address the issues of the people of Khyber-Pakhtunkhwa, where the effects of terrorism are directly felt. Making decisions while sitting in Islamabad shows that the government is not serious about addressing the issues of the province's people. This approach is unjust to the people, and disregards their sacrifices. The governor emphasised that unity on a grave issue like terrorism is the need of the hour, but this unity can only be achieved by including all political parties and schools of thought. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/Untitled-design-(5)1724919650-0/Untitled-design-(5)1724919650-0.png", "path": "full/4fb919c77baf009ee2c90bd9e1de37d7a98883d0.jpg", "checksum": "5d5dabe693ef366a225a55d72870082d", "status": "downloaded"}]},
{"title": "Financial crunch halts Pindi's uplift", "detail_url": "https://tribune.com.pk/story/2524919/financial-crunch-halts-pindis-uplift", "image_urls": ["https://i.tribune.com.pk/media/images/404262-RawalpindiBri_1735799875/404262-RawalpindiBri_1735799875.JPG"], "catagory": "Qaiser Shirazi", "content": "The fate of the Rawalpindi district hung in the balance in terms of infrastructure development and progress last year as the severe financial crunch in Punjab proved fatal for the district. Despite tall claims and loud announcements, not a single mega project for development and public welfare could be initiated. Ten mega projects with revised upward costs have still been pending. Due to the non-allocation of funds for these 10 projects in the last three years, these projects have become white elephants as their estimated cost has swelled by 40 to 60% owing to the soaring costs of building materials in the country's history. Among these 10 mega projects are Ghazi Brotha Water Supply, Ring Road, Leh Express, Daducha Dam, Sewage Treatment Plant, Rawal Dam filtration plants' upgradation, Zacha Bacha (mother-child) Hospital, Chahan Dam Water Supply Scheme, Commercial Parking Plaza, and lying of new small diameter pipeline in the obsolete cemented pipeline from Rawal Dam to Rawalpindi city. Many more projects were also added to the Annual Development Programme (ADP) but not even a single penny of funds was released for any of them. The Rawalpindi Development Authority (RDA), the Water and Sanitation Agency (WASA), the District Council and the Municipal Corporation (MC) expressed their excuses for initiating these projects due to the non-availability of funds. Rawalpindi was supposed to get 400 million gallons of water per day through three phases of the Ghazi Barotha Water Supply project to cater to water requirements for the next 100 years. For this, a 60 km water pipeline of 80 diameter was to be laid from Ghazi Barotha to Sangjani. Its estimated cost was Rs17 billion in 2006, which has now risen to Rs105b due to continuous delays. The Leh Express, a 30km signal-free road project, was started in 2008 but was closed when the PML-N came to power. Its estimated cost at that time was Rs17b and now has reached Rs100b today. Moving forward, a sewage treatment plant project was to be built to completely eliminate flooding in Rawalpindi city during monsoons with an estimated cost of Rs30b in 2019, which has now reached Rs60b. Under this, a large sewage pipeline with 10 feet width was to be laid on both sides of the lake. Similarly, the 5,500 kanal Gorakhpur water treatment plant was to be set up on the WASA land but it was also delayed. The foundation stone of the Rawalpindi Ring Road (RRR) project was laid in 2022. The work started but was stopped as the government changed. For the past three years, RDA officers and commissioners have been making announcements about the RRR project every month, but delayed funding has \"practically\" stalled the key project. As the estimated cost of the 38km long RRR has increased by around 40% and still the files for preparing its new estimated cost have become a rolling stone between Punjab and the federation. The Punjab chief minister set deadlines for the completion of the project three times but to no avail. Daducha Dam project was initiated in 2005 and the work on it started in 2021. But it also suffered due to lack of funds as its estimated cost has increased by Rs2b. The new water supply project from Chahan Dam to meet the water requirement of the water-deprived union councils (UCs) and Cantonment areas also faced a paucity of funds at the outset. The estimated cost of the project was initially Rs3b, which has now touched Rs6b. This year this key scheme was also halted due to the non-disbursement of funds. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/404262-RawalpindiBri_1735799875/404262-RawalpindiBri_1735799875.JPG", "path": "full/89858b409772a600018b91c14e1c8c9fb9dac2f7.jpg", "checksum": "b977399902ebcb1619c9aa94ffe5cb6b", "status": "downloaded"}]},
{"title": "New book honours artists displaced during Partition", "detail_url": "https://tribune.com.pk/story/2524921/new-book-honours-artists-displaced-during-partition", "image_urls": ["https://i.tribune.com.pk/media/images/8359-books-1318054954/8359-books-1318054954.jpg"], "catagory": "APP", "content": "The launch ceremony of a book titled \"Aasman Dar Aasman\" by former Vice-Chancellor of Allama Iqbal Open University (AIOU), Dr Shahid Siddiqui was held the other day. The book narrates the stories of those artists from the subcontinent who were carried across borders by the waves of partition. It features the moments and events from the lives of 45 renowned personalities, vividly portrayed by the author. The event was attended by the Vice-Chancellor of Allama Iqbal Open University, Dr Nasir Mahmood, Chairperson of the Pakistan Academy of Letters, Dr Najiba Arif, Dean of the Faculty of Social Sciences, Dr Abdul Aziz Sahir, poet and columnist Haris Khalique and writer and journalist, Rauf Klasra, who shared their thoughts about the book. The speakers highlighted that the book was a profound collection of the region's social history and is adorned with the finest elements of art, poetry and literature. They emphasised that the pain of migration deeply impacted human lives, often leaving scars that last for generations. This anguish is profoundly reflected on every page of the book. The speakers noted that the partition was a political act as \"the love for one's homeland endures, transcending distances and maintaining ties of affection between the two nations.\" COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/8359-books-1318054954/8359-books-1318054954.jpg", "path": "full/d7a5a63a0509049e2ec6659678ebb9bffce71740.jpg", "checksum": "2fcb709504e7bffedd8d0f8c66a669d0", "status": "downloaded"}]},
{"title": "Drought affects agriculture, water, public health", "detail_url": "https://tribune.com.pk/story/2524920/drought-affects-agriculture-water-public-health", "image_urls": ["https://i.tribune.com.pk/media/images/21770-agriculturereuterx-1399989813/21770-agriculturereuterx-1399989813.jpg"], "catagory": "Our Correspondent", "content": "Rawalpindi Division is facing a prolonged four-month drought for the first time in history, attributed to the effects of climate change. Traditionally, the region experiences significant rainfall from October to February, but this year, no rainfall has occurred since October. The drought has severely affected agriculture, water resources, and public health. The extended dry spell has caused widespread damage to wheat crops, summer-planted vegetables, and seasonal fruit orchards. Wheat crops in the Potohar region have stopped growing after reaching just one foot in height and are turning yellow due to the absence of rain. This could result in a severe decline in wheat production this year. Moreover, groundwater levels have plummeted further, exceeding depths of 700 to 800 feet. Tube wells, which previously operated effectively at depths of 300 to 500 feet, are at risk of running dry. This has also affected reservoirs such as Rawal Dam, Simly Dam, and Khanpur Dam, raising fears of a major water crisis during the upcoming summer months. Health concerns have also surged amid the drought. The dry weather has prolonged cases of colds, coughs, sore throats, eye inflammation, skin diseases, and stomach ailments. Public hospitals are reporting 2,000 to 3,000 cases daily, while private clinics are witnessing a rush of patients. Dr Inayat, Deputy Medical Superintendent (DMS) at Benazir Bhutto General Hospital, urged citizens to take preventive measures such as wearing masks, consuming warm foods like soups and stews, avoiding cold water and ice cream, and wearing proper protective clothing, especially at night. Agriculture Department Spokesperson Haroon Ahmed emphasised that the Potohar region relies heavily on rainfall for crops, gardens, and vegetables. The prolonged drought, he said, is having a devastating impact. He appealed for prayers for rain and announced a collective prayer for rainfall scheduled for Friday, February 1. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/21770-agriculturereuterx-1399989813/21770-agriculturereuterx-1399989813.jpg", "path": "full/59ae72c1332648b00615f522f5743b89835ac61b.jpg", "checksum": "6e5364aaf0e278fa5f33d0618192f155", "status": "downloaded"}]},
{"title": "Sharjeel announces reforms in VC appointment process", "detail_url": "https://tribune.com.pk/story/2524933/sharjeel-announces-reforms-in-vc-appointment-process", "image_urls": ["https://i.tribune.com.pk/media/images/201738016418-0/201738016418-0.jpg"], "catagory": "Our Correspondent", "content": "Sindh Senior Minister Sharjeel Inam Memon has stated that, in accordance with the decision of the Sindh Cabinet, the process for appointing Vice Chancellors of universities has been improved. The new approach allows not only teachers but also professor, retired professionals, and experts in the relevant field to be considered as candidates for the position of Vice Chancellor. Under the existing system, any professor is eligible to be appointed as a Vice Chancellor. The law enabling the appointment of professors as Vice Chancellors was also introduced by the Pakistan Peoples Party. While professors can still be appointed as Vice Chancellors, the criteria have now been broadened to include more options. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/201738016418-0/201738016418-0.jpg", "path": "full/9a46d629f56ded59ab972a4359da243d28576649.jpg", "checksum": "d04531928fb42352442b22eb5b545f59", "status": "downloaded"}]},
{"title": "Robbery turns out to be staged", "detail_url": "https://tribune.com.pk/story/2524932/robbery-turns-out-to-be-staged", "image_urls": ["https://i.tribune.com.pk/media/images/24868-robberyx-1416220193/24868-robberyx-1416220193.jpg"], "catagory": "Our Correspondent", "content": "A reported robbery incident turned out to be fake and a staged drama in the Napier area. The police arrested two suspects, identified as Shahid and Hasnain, and an amount of Rs110,000 was recovered from their possession. Police received a call on January 25, and the caller reported that two suspects had robbed Rs180,000 at gunpoint and fled. However, upon investigation, the police found inconsistencies in the statements of the callers who reported the robbery, raising suspicions. As the interrogation progressed, both callers confessed to staging the theft and admitted to making a false call. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/24868-robberyx-1416220193/24868-robberyx-1416220193.jpg", "path": "full/6ec2bb4555fa92d55fe57dbd646657239767e34d.jpg", "checksum": "84b18a1f7fe3af1091ab4498d84db7a9", "status": "downloaded"}]},
{"title": "One killed in attack on house", "detail_url": "https://tribune.com.pk/story/2524931/one-killed-in-attack-on-house", "image_urls": ["https://i.tribune.com.pk/media/images/2147464-womankilled-1580441718/2147464-womankilled-1580441718.jpg"], "catagory": "Our Correspondent", "content": "An armed suspect broke into a house in Mehmoodabad and opened fire, killing one person and seriously injuring another. As per the initial investigation, police see the incident as a case of personal enmity. A young man died and another injured in a firing incident at a house in Azam Town, Mehmoodabad on Monday morning. The deceased youth was identified as 26-year-old Musqatullah and injured as Zabihullah. The deceased and injured are brothers. Saleem, the cousin of victims, said that his younger brother Noman got married a few days ago. The deceased and injured had come from Dera Ismail Khan to attend a wedding ceremony. He said that everyone in the house was sleeping in the morning and there was a power shutdown. They heard gun shots and woke up. They found their cousin had been killed and the other cousin had been shot in the arm. They were taken to Jinnah Hospital. The victims were running a hotel in Dera Ismail Khan. The cousin suspects personal enmity behind the incident as nothing was stolen from the house. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/2147464-womankilled-1580441718/2147464-womankilled-1580441718.jpg", "path": "full/61b8e27359ebc8c165a6a3b9df90814ddfa690e3.jpg", "checksum": "038e081fa168b3e222826017d803ffc5", "status": "downloaded"}]},
{"title": "Illegal blood bank in Saddar area sealed", "detail_url": "https://tribune.com.pk/story/2524934/illegal-blood-bank-in-saddar-area-sealed", "image_urls": ["https://i.tribune.com.pk/media/images/1157245-bloodtransfusion-1470527489/1157245-bloodtransfusion-1470527489.jpg"], "catagory": "Our Correspondent", "content": "The Sindh Blood Transfusion Authority has sealed the Day and Night Thalassemia Haemophilia Care Centre in Saddar area for its involvement in illegal activities. The centre was providing blood to patients without legal permission, putting the lives of citizens at risk. Fake donor identification numbers were being used on blood bags with fake signatures from a foreign institution. The centre's temporary permit had expired in 2022. Blood was being provided to various hospitals, the screening of which was unsafe. A hospital had complained that the centre was involved in forgery of records and misuse of ISBT codes. The SBTA took action on complaints from other institutions, including Indus Hospital. A case was registered on the complaint of SBTA Secretary Dr. Durenaz Jamal. The illegal blood bank also had a guest house, while a cancer patient was given unsafe blood, which is tantamount to putting her life in danger. The centre employee also tried to threaten SBTA employees during the operation. According to Dr Durenaz, there is a risk of spreading diseases like Hepatitis B, C, HIV, malaria and syphilis through unsafe blood screening. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/1157245-bloodtransfusion-1470527489/1157245-bloodtransfusion-1470527489.jpg", "path": "full/937737ec6fb6115e392d6bc7a059aff96c49533f.jpg", "checksum": "4d95cbffe087be8a31888bfeb0cb47fd", "status": "downloaded"}]},
{"title": "Sanghar police accused of shielding PPP MNA in triple murder case", "detail_url": "https://tribune.com.pk/story/2524935/sanghar-police-accused-of-shielding-ppp-mna-in-triple-murder-case", "image_urls": ["https://i.tribune.com.pk/media/images/1101788-SindhPoliceAFP-1462990329/1101788-SindhPoliceAFP-1462990329.jpg"], "catagory": "Our Correspondent", "content": "As the Sanghar police refuse to nominate Pakistan Peoples Party's MNA Allauddin Junejo in the FIR of killing of three men and injuring over a dozen in an armed assault, the affected group of people arranged sit-ins with the dead bodies for the second day. The protest was staged outside Sanghar press club and the hope to see the protestors disperse ended after talks between the affected people and DIG Nawabshah failed to yield results. The incident happened on Sunday in village Jani Junejo in the limits of Chautiari police station. Mushtaq Junejo, Ali Baksh Junejo and Abdul Rasool Junejo were gunned down. At least 15 persons were injured. Several of them were later shifted to hospitals in Karachi, Hyderabad, and Nawabshah. The markets in Chautiari, a rural town of Sanghar, were closed down in reaction to the incident. Conflicting claims have emerged about the cause of the clash. The MNA and his supporters maintained that the slain and injured persons were allegedly attacked because their livestock animals were entering their agricultural fields time and again even though police were also involved in the matter. However, relatives of the dead and injured persons alleged that the MNA's armed men charged upon their village with the intention of occupying their land. Former MNA Naveed Dero, who joined the protestors outside Sanghar press club, accused MNA Junejo for the incident. In her statement, MNA Shazia Mari of the PPP condemned the killings of people in a clash between two groups. She requested the home minister Ziaul Hassan Lanjar and IGP Sindh Ghulam Nabi Memon to conduct an impartial probe and to bring culprits to the book. The supporters of Sarwari Jamaat MNA Makhdoom Jameeluz Zaman, who also belongs to the PPP, held a protest in Sanghar on Monday, condemned Sanghar police for its indifference to the incident. GM Hingorjo, Anwar Bhambro and other protestors denounced that the police neither timely responded to the incident nor it is showing any interest to round up the culprits. According to them, the slain and injured persons were associated with Sarwari Jamaat. The protestors bemoaned that the PPP is yet to condemn the killings of innocent people. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/1101788-SindhPoliceAFP-1462990329/1101788-SindhPoliceAFP-1462990329.jpg", "path": "full/00320e4f3a8eea31bb5460f46425f18e0a03ff40.jpg", "checksum": "123bf6e86210ed2d942f667ad1c965af", "status": "downloaded"}]},
{"title": "Govt aims to boost seafood exports amid EU ban", "detail_url": "https://tribune.com.pk/story/2524936/govt-aims-to-boost-seafood-exports-amid-eu-ban", "image_urls": ["https://i.tribune.com.pk/media/images/1461903-ExportsPeer-1500524228/1461903-ExportsPeer-1500524228.jpg"], "catagory": "Our Correspondent", "content": "Sindh Minister for Livestock and Fisheries Muhammad Ali Malkani has said that the provincial government is taking all necessary steps to increase seafood exports and is in contact with the federal government in this regard. Speaking during the Question Hour in the Sindh Assembly on Tuesday, Malkani replied to various written and supplementary questions from members. He informed the assembly that there are several hatcheries in Sindh for fish breeding, where seeds are sown. \"We release fish seeds into rivers at the government level.\" He said that efforts are being made to meet the standards set by the European Union to lift the ban on seafood exports, particularly for shrimp and fish. Malkani said that those who set up factories for export of fisheries are provided with assistance, but no subsidies are given. Senior Minister Sharjeel Inam Memon requested Deputy Speaker Naveed Anthony to address the issue of some members asking irrelevant questions. Memon noted that there are existing rules for asking questions in a member's absence. MQM's Dr Fauzia Hameed referred to the deplorable condition of fishermen's colonies, urging the government to take notice. Aijaz Haq also pointed out that poor fishermen's boats are sinking, and the government is not providing any facilities to help them. Abdul Waseem from MQM asked about the legal action taken against those using banned nets for fishing. In response, Muhammad Ali Malkani said that while action is taken, the department lacks sufficient resources. He also acknowledged the absence of cold storage facilities but assured that the department will help the fishermen in this regard. ucted in collaboration with community-based organisations. Meanwhile, parliamentary journalists made their voices heard in the assembly, protesting against the Prevention of Electronic Crimes Act (PECA) amendment and demanded its withdrawal. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/1461903-ExportsPeer-1500524228/1461903-ExportsPeer-1500524228.jpg", "path": "full/baa641bdd193ea95559c3fae5822cd4c8e6eb235.jpg", "checksum": "d5aa778ae7a7bafe58d9d3c58aeb2acc", "status": "downloaded"}]},
{"title": "Climate change hits Sindh's onion production: experts", "detail_url": "https://tribune.com.pk/story/2524938/climate-change-hits-sindhs-onion-production-experts", "image_urls": ["https://i.tribune.com.pk/media/images/nitrous-oxide1718199332-0/nitrous-oxide1718199332-0.jpg"], "catagory": "Our Correspondent", "content": "From culinary tastes to therapeutic benefits, onion is known to be one of the best nutritious vegetable. Sindh being an agricultural province has been until recently contributing up to 38% of the country's total onion harvest. However, experts at a seminar at Sindh Agricultural University (SAU) on Monday, voiced concern that climate change has entailed a significant decline in onion yield. Vice Chancellor of SAU Dr Altaf Ali Siyal underlined that the onion cultivation in Sindh is facing challenges from climatic shifts, insects and other biotic factors. He believed that advanced research, genetic breeding and eco-friendly farming practices can help mitigate the impediments to desirable harvest. Executive Director of Agriculture Research Sindh Dr Wali Muhammad Baloch argued that a lack of crop rotation practice in the province is also one of the contributing factors behind the drop in onion production. Director of the Nuclear Institute of Agriculture (NIA) Dr Mehboob Ali Siyal said Pakistan ranked among the top ten onion-producing countries. He offered collaboration to the SAU and other organisations to work in concert in order to address the production challenges. Director of the Seed Development and Production Center Dr Zahoor Ahmed Soomro presented a paper on the nutritional importance of onions and seed development. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/nitrous-oxide1718199332-0/nitrous-oxide1718199332-0.jpg", "path": "full/c67db95442eae488c7c190eb05668cdad3af70be.jpg", "checksum": "e87d9ef3b0c88facb7a872ab42ac9012", "status": "downloaded"}]},
{"title": "Model police station inaugurated in DHA", "detail_url": "https://tribune.com.pk/story/2524937/model-police-station-inaugurated-in-dha", "image_urls": ["https://i.tribune.com.pk/media/images/688570-JavedOdhoPHOTORASHIDAJMERI-1396044503/688570-JavedOdhoPHOTORASHIDAJMERI-1396044503.jpg"], "catagory": "Our Correspondent", "content": "A model police station, built on modern lines in Defence area, was inaugurated on Sunday. Additional IG Karachi Javed Alam Odho, DIG South Syed Asad Raza, SSP South Mehmood Ali, other police officers, famous singer and social leader Shehzad Roy, representatives of civil society, and government schools attended the opening ceremony. Speaking at the event, additional IG said, \"We aim to improve the culture of police stations so that citizens feel no fear or difficulty when visiting there.\" He also expressed gratitude to Shehzad Roy for his support. Renowned singer and social activists said that, children are taught at global level, that a policeman is his best friend. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/688570-JavedOdhoPHOTORASHIDAJMERI-1396044503/688570-JavedOdhoPHOTORASHIDAJMERI-1396044503.jpg", "path": "full/f6563ee6cfe1b989257af5ac500e4e08bdb6ef9d.jpg", "checksum": "0e0c8603aa25359d5ed9ce7400507477", "status": "downloaded"}]},
{"title": "SSWMB vows support for cleanliness drive", "detail_url": "https://tribune.com.pk/story/2524941/sswmb-vows-support-for-cleanliness-drive", "image_urls": ["https://i.tribune.com.pk/media/images/871083-Cleanlinessbroomsroad-1429210073/871083-Cleanlinessbroomsroad-1429210073.jpg"], "catagory": "Our Correspondent", "content": "Sindh Solid Waste Management Board (SSWMB) MD Tariq Ali Nizamani has pledged full support to the SITE Association of Industry in efforts to keep the SITE area clean and green. Speaking to SAI members during a recent visit, Nizamani highlighted his six-year experience with SSWMB in various roles, which has given him insight into the waste management challenges faced by industries in the SITE area. He also announced plans to extend waste-lifting agreements to other industrial zones. The Sindh Solid Waste Management Act, enacted in 2014 and gradually implemented from 2016, addresses Karachi's daily solid waste generation of approximately 14,000 tonnes. Keeping in view the sensitivity of the matter, the Lahore High Court directed all organisations to hold awareness sessions. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/871083-Cleanlinessbroomsroad-1429210073/871083-Cleanlinessbroomsroad-1429210073.jpg", "path": "full/abfbf7744b9d91c01e09f526d07f53c1e7915ade.jpg", "checksum": "7d1be6f735a6786ecfa9578e4b44d396", "status": "downloaded"}]},
{"title": "Gas market opening to slash circular debt", "detail_url": "https://tribune.com.pk/story/2524942/gas-market-opening-to-slash-circular-debt", "image_urls": ["https://i.tribune.com.pk/media/images/21711487108-1/21711487108-1.jpg"], "catagory": "Zafar Bhutta", "content": "The Special Investment Facilitation Council (SIFC) has facilitated the energy sector by opening gas market for the private sector, which is expected to contribute Rs71 billion per year to circular debt reduction. Additionally, the government will collect Rs13 billion annually on account of sales tax. These remarks were made by Universal Gas Distribution Company CEO Ghiyas Abdullah Paracha. Circular debt, which has plagued the energy sector for decades, has now crossed Rs1.6 trillion. Exploration and production (E&P) companies are owed $700 million owing to delay in payments by clients and gas curtailment. The recent decision of selling 35% gas, found by exploration firms, to a third party will help to resolve such non-payment issues. Earlier, oil and gas exploration companies were allowed to sell 10% of gas to third parties, which the current government increased to 35% in a bid to open the market and improve cash flow for energy firms. When contacted, Paracha, who is also a member of a special committee led by Deputy PM Ishaq Dar, praised the pivotal role of SIFC that facilitated critical reforms in the gas sector. \"With SIFC's consistent involvement, support and consultations with companies and stakeholders, policies and decisions are being implemented successfully,\" he said. These \"efforts will rejuvenate the energy sector and put Pakistan on the road to rapid development.\" Paracha said in case of 100 million cubic feet per day (mmcfd) of gas supply, companies would pay approximately $255.5 million in advance, equivalent to around Rs71.28 billion. This prepayment will prevent the accumulation of circular debt. Another key benefit is the increase in government revenue through sales tax. This policy is expected to generate roughly $46 million, or around Rs12.81 billion, in sales tax. Additionally, it will help save foreign exchange. \"If even one LNG (liquefied natural gas) cargo is not imported, the country can save about $400 million, or around Rs111 billion, in a year. This will significantly bolster the national exchequer,\" he added. Background discussions with officials of oil and gas exploration companies revealed that the government and gas firms would benefit significantly from the participation of private sector in gas marketing, distribution and sales. This collaboration will accelerate the development of Pakistan's energy sector and enhance self-reliance. They said that through the implementation of the new policy, the problem of circular debt would largely be resolved, potentially eliminating it from the gas sector. It will also have a positive impact on the cash flow of E&P companies, which will encourage further investment. Consumer gas prices are expected to fall gradually while earnings of gas companies will improve. Experts added that risks associated with new gas supplies would be reduced to zero and the unaccounted-for-gas will go further down. Moreover, they said, the government would no longer be required to subsidise any sector as the policy will attract more private companies and foreign investors. The government has laid the foundation; now the private sector must collaborate to drive the policy forward. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/21711487108-1/21711487108-1.jpg", "path": "full/0a0fa4e58a62d3fddd2fde48151c07b78f97af02.jpg", "checksum": "3a304f03e4f162ab2578cdbc1bd3d0b0", "status": "downloaded"}]},
{"title": "Policy rate slashed for sixth time", "detail_url": "https://tribune.com.pk/story/2524940/policy-rate-slashed-for-sixth-time", "image_urls": ["https://i.tribune.com.pk/media/images/211738017271-0/211738017271-0.jpg"], "catagory": "Usman Hanif", "content": "The monetary policy committee (MPC) of the State Bank of Pakistan (SBP), in its meeting on Monday, announced the sixth successive reduction in policy rate, bringing it down by 100 basis points (bps) to 12%, effective January 28, 2025. The decision comes amid key economic developments, including improved activity in the real sector, a cumulative surplus in current account, a significant increase in revenue and a rapidly declining inflation. \"At its meeting today (Monday), the MPC decided to cut the policy rate by 100 bps to 12%, effective from January 28, 2025,\" SBP Governor Jameel Ahmad said at a press conference after the meeting. The decision reflects optimism over declining inflation, which reached 4.1% in December, driven by moderate domestic demand and supportive supply-side factors. MPC highlighted improving economic activity, a current account surplus of $1.2 billion in 1HFY25 and a notable 26% increase in the Federal Board of Revenue's tax collection during the first half of the current fiscal year. However, challenges persist, including a modest 0.9% GDP growth in 1QFY25, high core inflation and fiscal revenue shortfalls. This policy stance aims to ensure price stability while maintaining the real policy rate within a positive range, with inflation expected to average between 5.5% and 7.5% for FY25. The SBP governor said headline inflation decreased fast from 38% in May 2023 to 4.1% in December and it may even further decrease for the next few months before resuming upward trajectory in June 2025. The declining trend in inflation is mainly led by the downward adjustment in electricity tariffs, adequate supply of key food items leading to low levels of food inflation, stability in exchange rate and a favourable base effect, MPC said. Underlying inflationary pressures, as indicated by the core inflation, also moderated amidst contained domestic demand, though these remain elevated. Moreover, inflation expectations also remained volatile. Based on these trends, the MPC reiterated its earlier assessment that the near-term inflation would remain volatile and was expected to increase close to the upper bound of the target range towards the end of FY25. On balance, the MPC expects headline inflation for FY25 to average between 5.5% and 7.5%. Going forward, inflation outlook is subject to risks emanating from volatile global commodity prices, protectionist policies in major economies, timing and magnitude of administered energy tariff adjustments, volatile perishable food prices as well as any additional measures to meet the revenue target. Driven by strong workers' remittances and export earnings, the current account posted a surplus of $0.6 billion in December, bringing the cumulative surplus to $1.2 billion during 1HFY25. Led by HVA textile, exports maintained a strong momentum. At the same time, import growth also showed broad-based acceleration on the back of higher volumes, pointing towards improvement in economic activity. While the import bill outpaced export earnings, remittance inflows more than offset the widening trade deficit. Based on these trends, particularly the robust remittances, the current account outlook has improved considerably and it is now expected to remain between a surplus and deficit of 0.5% of GDP in FY25. Meanwhile, net financial inflows, though tepid during 1HFY25, are expected to improve as a sizable part of official debt repayments has already been made. Consequently, the improved current account outlook, along with expected realisation of planned financial inflows, is likely to increase the SBP's foreign currency reserves beyond $13 billion by June 2025. The latest high-frequency indicators show sustained economic momentum, with increases in automobile, petroleum and fertiliser sales, import volumes, electricity generation and private sector credit disbursement. However, the real GDP growth slowed to 0.9% in 1QFY25 from 2.3% in 1QFY24, mainly due to a sharp decline in agricultural growth to 1.2%. Key industrial sectors like textile, food and automobiles improved, while business confidence remains positive. MPC projects GDP growth to remain between 2.5% and 3.5%. FBR's revenues grew 26% in 1HFY25, but tax collection fell short of targets, requiring rapid growth to meet annual goals. Lower interest payments are expected to keep fiscal deficit near target, though achieving primary balance remains challenging. Government borrowing shifted to non-bank sources, while private sector credit surged. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/211738017271-0/211738017271-0.jpg", "path": "full/bf4cc96a8a509d782506d677c4d0ce70f598a96b.jpg", "checksum": "40fe49b2cd4ce3fef1bc83fb5a02bae3", "status": "downloaded"}]},
{"title": "Marvel Studios updates fans on Agatha All Along series", "detail_url": "https://tribune.com.pk/story/2524939/marvel-studios-updates-fans-on-agatha-all-along-series", "image_urls": ["https://i.tribune.com.pk/media/images/agatha1720073806-0/agatha1720073806-0.jpg"], "catagory": "Pop Culture & Art", "content": "Marvel fans hoping for a second season of Agatha All Along will be disappointed, as showrunner Jac Schaeffer has confirmed that the series will remain a one-off. Patti LuPone, who starred in the Disney+ series, revealed the news during an interview on Andy Cohen Live. “There won’t be one,” LuPone shared, recounting a conversation with Schaeffer. “Jac came into my trailer and said, ‘Patti, I’m just here to tell you that Lilia’s going to die,’ and I went, ‘But I wanted a second season.’ [Schaffer] said, ‘I don’t do second seasons.’ She added, ‘They wanted me to do a second season of WandaVision, and I didn’t.’” Schaeffer, known for her work on WandaVision and Agatha All Along, has stated that the demands of writing a second season do not align with her creative process. Instead, she prefers crafting standalone stories. The show, a spin-off from WandaVision, explored the life of Agatha Harkness, played by Kathryn Hahn, as she brought together a coven of witches. While the series connected to WandaVision, it stood as its own story rather than a continuation. As Marvel Studios moves toward a multiverse-focused storyline with projects like Secret Wars and Captain America: Brave New World, the magical elements introduced in Agatha All Along may resurface in future MCU installments. Fans of Agatha Harkness and the witches will have to wait and see how their stories unfold in Marvel’s evolving cinematic universe. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/agatha1720073806-0/agatha1720073806-0.jpg", "path": "full/677b933ba7786d1bb6007192fcd8faefdd9e8a98.jpg", "checksum": "022d4e4047171213dda6f8a36c50ecbd", "status": "downloaded"}]},
{"title": "Gold prices, rupee value depreciate", "detail_url": "https://tribune.com.pk/story/2524943/gold-prices-rupee-value-depreciate", "image_urls": ["https://i.tribune.com.pk/media/images/gold1111111-145896-146519-152757-153284/gold1111111-145896-146519-152757-153284.jpg"], "catagory": "Our Correspondent", "content": "The rupee experienced a minor decline against the US dollar, depreciating by 0.03% in the interbank market on Monday. By the close of trading, the rupee settled at 278.83, reflecting a loss of 8 paisa compared to the previous trading day. Over the past week, the rupee remained relatively stable, closing at 278.75, a slight drop from 278.71, according to the State Bank of Pakistan (SBP). Market experts attribute the rupee's depreciation to three key factors: rising imports of around $5 billion per month, the SBP's dollar purchases to absorb surplus supply, and foreign loan repayments by the central bank. Internationally, the US dollar strengthened on Monday as traders evaluated the implications of US President Donald Trump's tariff policies. Although the dollar recorded its weakest performance since November 2023 last week due to diminished tariff concerns, fears resurfaced after Trump announced sweeping measures against Colombia. The tariffs and sanctions came in response to Colombia's refusal to permit US military aircraft carrying deported migrants to land, reigniting market uncertainty as the Federal Reserve is expected to keep interest rates steady. Meanwhile, gold prices in Pakistan continued their decline on Monday, in line with global market trends. The price of gold per tola dropped by Rs300 to Rs289,100, while the price for 10 grams fell by Rs257 to Rs247,856, according to the All-Pakistan Gems and Jewellers Sarafa Association (APGJSA). This follows a Rs200 decrease over the weekend. Globally, gold prices dropped by $3 to $2,767 per ounce on Monday, down from Friday's high of $2,785. Market analyst Adnan Agar, Director at Interactive Commodities, predicts gold will trade between $2,730 and $2,750 in the near term. Prices falling below this range could trigger a significant downward trend. However, stabilisation is more likely, with upcoming US monetary policy decisions expected to further influence gold prices. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/gold1111111-145896-146519-152757-153284/gold1111111-145896-146519-152757-153284.jpg", "path": "full/8d91199618a3ff9b5832bd89f1497260095c635e.jpg", "checksum": "83e1f9c1d88c10ad8139ec1337ffd42e", "status": "downloaded"}]},
{"title": "No reduction in industrial power prices", "detail_url": "https://tribune.com.pk/story/2524944/no-reduction-in-industrial-power-prices", "image_urls": ["https://i.tribune.com.pk/media/images/924635-Powersupplyphotofile-1437628876/924635-Powersupplyphotofile-1437628876.jpg"], "catagory": "Shahbaz Rana", "content": "The International Monetary Fund (IMF) has not endorsed Pakistan's proposal to further reduce industrial electricity prices by Rs2.70 per unit through the complete elimination of cross-subsidies, which the sector is providing to shoulder subsidies to low-end residential consumers. Energy ministry sources told The Express Tribune that the ministry floated the proposal to further reduce electricity prices for industries by Rs2.70 per unit. This would have provided nearly Rs37 billion relief to the industrial sector for the February-June period of this fiscal year. The annual impact had been estimated at Rs89 billion. The proposal was shared with the IMF last week, which has objected to it on the grounds that the government should aim at overall power sector reforms. The IMF's objection was that Pakistan should not implement this proposal in isolation. The government is working on a proposal to move from a general to a targeted subsidies regime in collaboration with the IMF. The new regime may be rolled out in July this year, which would address the issue of cross-subsidies, said the sources. \"We have decided not to follow that route and work on a comprehensive proposal to bring down power tariffs for all segments,\" said Zafar Yab Khan, the spokesperson for the Ministry of Energy. He was requested to comment on the IMF's observations about the proposal to reduce industrial tariffs by Rs2.70 per unit. It was the second such cut that the government wanted to extend to the industrial sector in the past seven months. But it again ignored the residential consumers who are also cross-subsidising the below 300 units/month consumers' bills. Earlier, Prime Minister Shehbaz Sharif had announced a reduction in electricity tariffs for the industrial sector by Rs10.69 per unit to boost production and exports, according to an official announcement by the Prime Minister's Office in June last year. Deputy Prime Minister Ishaq Dar also chaired a meeting on power tariffs for industrial consumers last week, said the sources. Earlier, the IMF had also not given the go-ahead for a Rs4.80 per unit reduction in electricity prices for consumers by abolishing taxes. This would have provided Rs580 billion annual relief to residential consumers. To compensate for the Rs580 billion losses, the Power Division had proposed increasing the current Petroleum Levy rate of Rs60 per litre and sacrificing the Public Sector Development Programme (PSDP), according to government sources. The Power Division had proposed that income tax, sales tax, further tax, extra tax, electricity duty, and the television fee being charged on electricity bills be abolished. Many of these taxes are unjustified, but due to the Federal Board of Revenue (FBR)'s failure to expand the tax base, the bills are used as a tool to collect revenues. The elimination of six types of taxes would have resulted in a Rs4.77 per unit price reduction, but it would have dented federal and provincial revenues by Rs580 billion per annum, said the sources. Out of the Rs580 billion, there was an estimated hit of Rs352 billion on the provinces. The federal government could have sustained a Rs230 billion hit, according to the sources. The per-unit electricity cost, including all taxes and surcharges, is about Rs65 to Rs70 per unit, which has already forced consumers to shift to rooftop solar panels. The plan states that by abolishing income tax and reducing the sales tax to the extent of only input tax adjustment claims of the power producers, the government can reduce the electricity price by Rs4.12 per unit. The annual impact of reducing and abolishing these taxes is Rs502 billion. Under the 7th National Finance Commission award, 57.5% of federal tax collection goes to the provinces as their shares. Then there is an extra tax carrying an annual implication of Rs64 billion. The government collects Rs62 billion in electricity duty, and its elimination would have resulted in a 51 paisa per unit reduction. There is also a Rs35 per bill PTV fee. The government collects Rs16 billion annually in PTV fees, and its elimination could have reduced electricity prices by 13 paisa per unit. There could have been a negative impact of Rs182 billion on Punjab due to the reduction in taxes, duties, and fees. Sindh would have taken an annual hit of Rs86 billion, Khyber-Pakhtunkhwa Rs54 billion, and Balochistan Rs28 billion. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/924635-Powersupplyphotofile-1437628876/924635-Powersupplyphotofile-1437628876.jpg", "path": "full/d106ba6b8213e3686e5d95930bd9f437db236e06.jpg", "checksum": "a7100a520f74a48f452c48aa775226d4", "status": "downloaded"}]},
{"title": "Industrialists decry 1% rate cut", "detail_url": "https://tribune.com.pk/story/2524945/industrialists-decry-1-rate-cut", "image_urls": ["https://i.tribune.com.pk/media/images/221738017270-1/221738017270-1.jpg"], "catagory": "GOHAR ALI KHAN", "content": "Rejecting the 1% cut in interest rate as tiny, industrialists and traders have asked the State Bank of Pakistan (SBP) to do more, with a view to boosting economic growth. They said the poor economic strategy of the government and the central bank dismayed the entire business community of the country. They called for a more holistic and pragmatic approach to monetary policy, one that aligns not only with the region but also with the government's broader objectives of economic growth, export enhancement, and employment generation. Expressing strong disappointment over the SBP's decision to implement a nominal reduction of just 1% in the policy interest rate, Karachi Chamber of Commerce and Industry (KCCI) President Muhammad Jawed Bilwani criticised the move as insufficient to address the prevailing economic challenges and unlock the country's growth potential. He said the decision reflects a lack of urgency in addressing the critical financial and economic issues faced by businesses, particularly small and medium-sized enterprises (SMEs) across the country. \"Despite the prime minister's assurances of bringing the interest rate down, the SBP has kept it to 12%, which the business community is unable to understand,\" he said. Bilwani added that businesses are operating under severe strain due to an unprecedented increase in input costs, including energy tariffs, fuel prices, and raw material costs, coupled with a volatile exchange rate. He said the recent decline in inflationary pressures provided ample room for the SBP to implement a more aggressive cut in interest rates. Notably, Pakistan's annual consumer price inflation rate dropped to 4.1% in December 2024, the lowest level in more than six years. This significant decrease from the multi-decade high of around 40% in May 2023 is attributed to a stable currency, lower global commodity prices, and improved supply chains. Federal B Area Association of Trade and Industry (FBATI) President Shaikh Muhammad Tahseen said the policy rate should be decreased to a single digit to entice a majority of businessmen and industrialists to borrow money from commercial banks. The SME sector needs financing of a substantial level, but commercial banks continue to support a limited section of industry tycoons to avoid penalties against lower advance-to-deposit ratio (ADR), he said. The SMEs are the backbone of the national economy; if this segment is supported, the economy will definitely flourish. He urged the government and banking regulator to devise a scheme for SMEs at affordable markup rates to revive their production and expansion on a long-term basis. The Monetary Policy Committee (MPC) should take a bold step in the next meeting and announce a drastic cut of 5%, he said. Speaking to The Express Tribune on Monday, SITE Association of Industry (SAI) Karachi President Ahmed Azeem Alvi said, \"Prime Minister Shehbaz Sharif announced Uraan Pakistan (programme) for better economic growth, but the bureaucracy has raised the gas tariff by 25%, and the central bank is reluctant to reduce the interest rate. If a team leader asks for something anywhere in the world, the rest of the team backs it and fulfils his commitment in letter and spirit. In this country, the PM and bureaucracy go in different directions.\" Alvi said high-interest loans are hindering economic recovery and discouraging investment, explaining that as a result, investor confidence is discouraged, and the prospects for accelerating business activities have diminished. Pakistan Chemicals & Dyes Merchants Association (PCDMA) Chairman Salim Valimuhammad has rejected the SBP's 1% reduction in the interest rate, calling it insufficient. Federation of Pakistan Chambers of Commerce and Industry (FPCCI) President Atif Ikram Sheikh said after deliberations across all industries and sectors, FPCCI demanded an immediate and single-stroke rate cut of 500 basis points (bps) in Monday's Monetary Policy Committee (MPC) meeting to rationalise the monetary policy and align it with the vision of the Special Investment Facilitation Council (SIFC) and the prime minister's vision for economic growth and exports growth. welcoming the SBP's proactive approach, the LCCI urged the government and the central bank to take additional steps to further strengthen the economy. These include addressing energy costs to reduce production expenses, introducing tax reforms to ease the financial burden on businesses and providing targeted support to SMEs. The business community also emphasised the importance of continued engagement with stakeholders to resolve structural economic challenges effectively. The LCCI leaders also called on commercial banks to extend the benefits of the reduced discount rate by lowering their lending rates for businesses, especially for SMEs and startups, which play a vital role in driving economic activity. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/221738017270-1/221738017270-1.jpg", "path": "full/d8e3f8971091648669f7363a81fc1779dc387cc7.jpg", "checksum": "449bf278e45141cc5cb6764e01af013a", "status": "downloaded"}]},
{"title": "Textile millers term gas tariff hike 'disastrous'", "detail_url": "https://tribune.com.pk/story/2524946/textile-millers-term-gas-tariff-hike-disastrous", "image_urls": ["https://i.tribune.com.pk/media/images/985944-AptmaFarhancopy-1446743140/985944-AptmaFarhancopy-1446743140.jpg"], "catagory": "Our Correspondent", "content": "All Pakistan Textile Mills Association (Aptma) Southern Zone Chairman Naveed Ahmed has described the Economic Coordination Committee's (ECC) recent decision to increase gas tariff for captive power plants (CPPs) from Rs3,000 per million British thermal units (mmBtu) to Rs3,500 per mmBtu as anti-export, which will be disastrous for the textile industry having 60% share in exports of the country. He demanded that the federal government reverse its decision of the unprecedented increase in gas tariff to make textile exports competitive in the international market, which had been continuously eroded by the surge in energy prices over the last two years. He said the government increased gas tariff for CPPs only while tariffs for all other sectors including fertiliser and processing firms as well as domestic consumers had been left unchanged. \"This targeted discrimination is not acceptable.\" Naveed Ahmed said the recent 16.7% increase in tariff for industries having CPPs and using gas for electricity generation to operate mills was the final nail in the coffin of the export-oriented textile industry. He called textile sector the backbone of Pakistan's exports, which was not only earning much-needed foreign exchange but was also providing employment to millions of workers directly or indirectly. Owing to an astronomical hike of 311% in gas tariff in the last two years, he said, the textile industry was becoming uncompetitive in the international market as energy costs accounted for a large share in the cost of goods production. \"With the highest energy cost in the region, highest cost of borrowing and taxes, Pakistani textiles will be uncompetitive in the international market.\" Hence, the recent increase in gas tariff would not only prove to be detrimental to the export growth target set by the prime minister in Uraan Pakistan but would also result in losing the hard-earned overseas markets. The Aptma southern zone chairman pointed out that the industry had invested billions of rupees in gas-based power generation for uninterrupted supplies for their own consumption as power distribution companies in Sindh and Balochistan did not have the capacity to provide the required load of electricity to the industry. The government was trying to encourage the use of grid electricity instead of power produced by CPPs, without realising that the policy was not implementable in Sindh and Balochistan due to poor capacity and inconsistency in supply of grid electricity, he added. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/985944-AptmaFarhancopy-1446743140/985944-AptmaFarhancopy-1446743140.jpg", "path": "full/6b231bbfd7a5c1b67bc5c9313f40bf8c50727a06.jpg", "checksum": "5a556ff747039416edac467078f0bada", "status": "downloaded"}]},
{"title": "Tanveer expresses dismay over low rate cut", "detail_url": "https://tribune.com.pk/story/2524947/tanveer-expresses-dismay-over-low-rate-cut", "image_urls": ["https://i.tribune.com.pk/media/images/779654-sbpstorycopy-1414010003/779654-sbpstorycopy-1414010003.jpg"], "catagory": "Our Correspondent", "content": "United Business Group (UBG) Patron-in-Chief SM Tanveer has expressed disappointment over the State Bank of Pakistan's (SBP) decision to reduce policy rate by only 100 basis points (bps), saying that the business community had expected a minimum reduction of 200 bps. In a statement, Tanveer pointed out that Pakistan's economy was recovering after a three-year slump, during which economic activity came to a standstill and Rs32 trillion was invested in banks. He emphasised that the government must now create a favourable environment for economic growth and development. Suggesting measures for boosting growth, he called for an early decision on the independent power producers (IPPs) to ensure stable power supply, reactivation of the construction sector, which drives 72 related industries, implementation of a realistic monetary policy by reducing the rate to 9% and developing a robust fiscal policy. Tanveer commended the Special Investment Facilitation Council's (SIFC) proactive approach to promote early cotton cultivation and stressed the need for steps to locally produce edible oil. \"It will yield positive results and ease the impact on import bill.\" COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/779654-sbpstorycopy-1414010003/779654-sbpstorycopy-1414010003.jpg", "path": "full/f09f002b526b8796eb87d5664fef50a620d19967.jpg", "checksum": "4b1c56c08a60e04170115cf7d037a939", "status": "downloaded"}]},
{"title": "UNICEF, govt discuss climate, food security", "detail_url": "https://tribune.com.pk/story/2524948/unicef-govt-discuss-climate-food-security", "image_urls": ["https://i.tribune.com.pk/media/images/933670-UNICEF-1438894563/933670-UNICEF-1438894563.jpg"], "catagory": "Our Correspondent", "content": "UNICEF Representative in Pakistan Abdullah A Fadil met with Coordinator to the Prime Minister on Climate Change, Romina Khurshid Alam, on Monday, according to a press statement. They discussed critical issues related to climate change, food security, and the protection of vulnerable populations, particularly children. The meeting underscored the importance of joint efforts between the government and international organisations to combat the impacts of climate-related disasters, including droughts and extreme weather events. As per the statement, they emphasised the severe challenges posed by climate change, which have exacerbated food insecurity in Pakistan. Alam highlighted that food security is one of the greatest challenges of the future, as increasing droughts and climate variability threaten agriculture, disrupt food production, and exacerbate water shortages across the country. To address this, she called for widespread promotion of climate-resilient agricultural practices, including planting three fruit treesavocado, orange, and bananaat every household. This initiative, she explained, would help meet food security challenges while contributing to environmental sustainability, the statement read. The meeting included a discussion of global best practices, with Alam citing African countries that have integrated crops like banana, avocado, and citrus into their economies. \"These crops are now being exported to lucrative markets in Europe and the Middle East, providing African nations with significant economic benefits,\" she said. Alam emphasised empowering young girls with climate-resilient skills. Referring to her meeting with Dr Haddy of ICESCO, she highlighted the need for green-skilled education programs for girls to prepare them for climate challenges. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/933670-UNICEF-1438894563/933670-UNICEF-1438894563.jpg", "path": "full/7d02c1e16687adf56e229c1a01fd8160ac0702ba.jpg", "checksum": "052806b4e56d514f81a2d988c7dd95b2", "status": "downloaded"}]},
{"title": "Below-expectation results drag down PSX", "detail_url": "https://tribune.com.pk/story/2524949/below-expectation-results-drag-down-psx", "image_urls": ["https://i.tribune.com.pk/media/images/1463611-psx-1500697961/1463611-psx-1500697961.jpg"], "catagory": "Our Correspondent", "content": "Pakistan Stock Exchange (PSX) on Monday exhibited bearish activity on the back of a slump in global equities and weak crude oil prices. Adding to the market trouble included the uncertainty surrounding talks between the government and Pakistan Tehreek-e-Insaf (PTI), monetary policy decision by the State Bank of Pakistan (SBP) later in the day and concerns over the proposed Tax Laws Amendment Bill. Despite a promising start, when the KSE-100 index surged to the intra-day high of 716 points, the market reversed course, closing down by 1,360 points, or 1.18%, at 113,520.32. Weaker-than-expected earnings from Mari Petroleum, among other factors, dampened investor sentiment, contributing to the negative momentum. However, despite the downturn, there was cautious optimism among analysts that a potential rate cut could revive interest. Ahsan Mehanti of Arif Habib Corp commented that stocks turned bearish amid a slump in global equities and weak global crude oil prices. He added that uncertainty over the outcome of talks between the government and PTI, the SBP's policy rate decision to be announced later in the day and worries over the proposed Tax Laws Amendment Bill, which restricts non-filers from making stock purchases, played the role of catalysts in the bearish activity. At the close of trading, the benchmark KSE-100 index recorded a decrease of 1,360.16 points, or 1.18%, and settled at 113,520.32. In its review, Topline Securities stated that the market opened on a positive note, with the index touching an impressive intra-day high of 716 points. However, the momentum was short-lived as bears swiftly took charge. The index plunged to the intra-day low of 1,398 points before closing at 113,520, marking a decline of 1,360 points, or 1.18%, it said. The negative trend could largely be attributed to weaker-than-expected financial results of Mari Petroleum, which dampened investor sentiment. The company reported earnings per share (EPS) of Rs9.3, with no cash payout, which came in below market expectations and contributed significantly to the bearish activity, Topline said. The brokerage house said that Pakistan Oilfields declared 2QFY25 results, where the company posted EPS of Rs26.7, taking 1HFY25 earnings to Rs35.7 per share, along with cash dividend of Rs25 per share. JS Global analyst Muhammad Hasan Ather commented that the KSE-100 index saw a significant dip, mainly led by uncertainty about the monetary policy committee decision and a few below-expected results. Despite the downtrend, there was optimism that a substantial rate cut could positively impact market sentiment. Investors were looking forward to the results season, expecting significant dividends from some banks and fertiliser firms, Ather added. Ali Najib of Insight Securities remarked that the PSX resumed the week on a positive note, however, selling headwinds compelled the benchmark index to lose earlier gains. The main culprit behind Monday's pessimism was Mari Energy, which reported EPS of Rs9.3 for 2QFY25, significantly below street expectation of Rs12.5, with no dividend. Post-result announcement, the stock lost more than 8% and pulled the index down by 375 points, Najib observed. Later, he added, the SBP announced a reduction of 100 basis points in its policy rate that reached 12%. Overall trading volumes decreased to 494 million shares compared with Friday's tally of 632 million. Shares of 442 companies were traded. Of these, 97 stocks closed higher, 298 fell and 47 remained unchanged. Sui Southern Gas Company was the volume leader with trading in 51.65 million shares, falling Rs4.39 to close at Rs39.53. It was followed by Cnergyico PK with 50.7 million shares, falling Rs0.14 to close at Rs7.57 and WorldCall Telecom with 29.1 million shares, falling Rs0.06 to close at Rs1.73. Foreign investors bought shares worth Rs385.7 million. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/1463611-psx-1500697961/1463611-psx-1500697961.jpg", "path": "full/a52440d537aaefef2d016becf923211e56ad066b.jpg", "checksum": "bf0dc3415011cd2174e07dca14ed20bb", "status": "downloaded"}]},
{"title": "Experts urge action to combat low output", "detail_url": "https://tribune.com.pk/story/2524950/experts-urge-action-to-combat-low-output", "image_urls": ["https://i.tribune.com.pk/media/images/1878462-Importersexportersx-1546273988/1878462-Importersexportersx-1546273988.JPG"], "catagory": "Our Correspondent", "content": "Agriculture experts have stressed the need for community-based research to tackle the decline in onion production caused by climate change. The soaring price of onions, a staple in Pakistani cuisine, has placed them out of reach for many citizens. Experts pointed out that Sindh, contributing 38% to the nation's total onion production, faces significant challenges due to climatic shifts, emphasising the urgent need for sustainable farming solutions. This concern was raised during a seminar on \"Onion Breeding and Technology,\" hosted by Sindh Agriculture University (SAU) Tandojam, in collaboration with the Higher Education Commission (HEC) Islamabad. The seminar was part of an ongoing project titled \"Genetic Characterisation, Evaluation, and Selection of Onion Germplasm Entries for Resistance to Onion Thrips.\" SAU Vice Chancellor Dr Altaf Ali Siyal highlighted the adverse impact of climate change and biotic factors on onion cultivation in Sindh. He urged for advanced research, genetic breeding, and eco-friendly farming practices to counter these challenges. He also urged agricultural institutions like SAU to guide farmers in improving both yield and quality. Dr Wali Muhammad Baloch, Executive Director of Agriculture Research Sindh, cited diseases, climate-related issues, and the absence of crop rotation practices as key reasons for the decline in onion production. Dr Mehboob Ali Siyal, Director of the Nuclear Institute of Agriculture (NIA), noted that Pakistan ranks among the top 10 onion-producing nations globally. However, climatic shifts and other factors have made onions increasingly unaffordable. He expressed NIA's willingness to collaborate with SAU and other research institutions to address production challenges. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/1878462-Importersexportersx-1546273988/1878462-Importersexportersx-1546273988.JPG", "path": "full/4a94b286d69ab3e0806f704a8532f058bbde5d88.jpg", "checksum": "a18814f3ba178522657d9cb2c9460235", "status": "downloaded"}]},
{"title": "Bill Burr slams Howie Mandel for podcast stunt with Billy Corgan", "detail_url": "https://tribune.com.pk/story/2524951/bill-burr-slams-howie-mandel-for-podcast-stunt-with-billy-corgan", "image_urls": ["https://i.tribune.com.pk/media/images/howie-mendal1738018061-0/howie-mendal1738018061-0.png"], "catagory": "Pop Culture & Art", "content": "Comedian Bill Burr called out Howie Mandel after an unexpected appearance by Smashing Pumpkins’ Billy Corgan during an episode of Howie Mandel Does Stuff.  The January 21 podcast featured a heated exchange after Mandel surprised Burr with Corgan, who shared an awkward story about being told they might be half-brothers. “You’re an a—hole,” Burr, 56, said to Mandel after Corgan, 57, joined mid-interview. Mandel admitted he thought it would be “a good surprise,” but Burr clearly disagreed, asking if the segment could be edited out. The controversy stems from a past comment by Corgan's stepmother, who suggested Burr might be one of her late husband’s illegitimate children, based on their striking resemblance. During the podcast, Burr criticized Mandel’s motives, accusing him of prioritizing ratings over respect. “He’s bringing you in here, not because he’s trying to heal the bulls—t that we went through growing up,” Burr said. Corgan, who initially believed Mandel was aware of the story, revealed that Mandel encouraged him to share it on air after a private conversation. “He said, ‘Oh, you’ve got to say this on the air,’” Corgan explained. While Burr expressed no ill will toward Corgan, he admitted the incident brought back painful memories of his father. “It’s not that I don’t like him; it reminds me of all of that s–t,” Burr said. Corgan clarified that he does not believe they are related, adding, “There are just people in the world that look alike.” The ambush left Burr frustrated, with the comedian calling the situation a “ratings stunt.” Mandel has yet to respond publicly. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/howie-mendal1738018061-0/howie-mendal1738018061-0.png", "path": "full/6712837fa458735008991ed1f0e4ad78ca01647d.jpg", "checksum": "0475eea75711eb4662ae8b5391bc6d54", "status": "downloaded"}]},
{"title": "India, China agree to resume flights", "detail_url": "https://tribune.com.pk/story/2524952/india-china-agree-to-resume-flights", "image_urls": ["https://i.tribune.com.pk/media/images/281738017639-5/281738017639-5.jpg"], "catagory": "Afp", "content": "India and China agreed in principle on Monday to resume direct flights between the two nations, nearly five years after the Covid-19 pandemic and subsequent political tensions halted them. The announcement came at the conclusion of a visit to Beijing by New Delhi's top career diplomat and heralds the latest signs of a thaw in the frosty ties between the world's two most populous nations. Indian foreign ministry secretary Vikram Misri's trip to the Chinese capital marked one of the most senior official visits since a deadly Himalayan troop clash on their shared border in 2020 sent relations into a tailspin. A statement from India's foreign ministry said a visit by a top envoy to Beijing had yielded agreement \"in principle to resume direct air services between the two countries\". \"The relevant technical authorities on the two sides will meet and negotiate an updated framework for this purpose at an early date,\" it said. India's statement also said China had permitted the resumption of a pilgrimage to a popular shrine to the Hindu deity Krishna that had also been halted at the start of the decade. Both sides had committed to work harder on diplomacy to \"restore mutual trust and confidence\" and to resolve outstanding trade and economic issues, the statement said. Around 500 monthly direct flights operated between China and India before the pandemic, according to Indian media outlet Moneycontrol. A statement from China's foreign ministry did not mention the agreement on flight resumptions but said both countries had been working to improve ties since last year. \"The improvement and development of China-India relations is fully in line with the fundamental interests of the two countries,\" the Chinese statement said. India and China are intense rivals competing for strategic influence across South Asia. Flights between both countries were halted in early 2020 at the start of the pandemic. Services to Hong Kong eventually resumed as the public health crisis receded but not to the Chinese mainland, owing to the bitter fallout of the deadly troop clash later that year. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/281738017639-5/281738017639-5.jpg", "path": "full/4f12746a0ad2a7e94fb7db562e20dca7a8b60979.jpg", "checksum": "1d8aa28bde3a386ff8184274f858b7a3", "status": "downloaded"}]},
{"title": "Silicon Valley rattled by low-cost Chinese AI", "detail_url": "https://tribune.com.pk/story/2524953/silicon-valley-rattled-by-low-cost-chinese-ai", "image_urls": ["https://i.tribune.com.pk/media/images/291738017639-6/291738017639-6.jpg"], "catagory": "Afp", "content": "Fears that the AI gold rush could be under threat rocked Wall Street on Monday following the emergence of a ChatGPT-like model from China, triggering predictions of turmoil for Silicon Valley and accusations of cheating. Last week's release of the latest DeepSeek model initially received limited attention, overshadowed by the inauguration of US President Donald Trump that took place the same day. However, over the weekend, the Chinese artificial intelligence startup's chatbot surged to become the most downloaded free app on Apple's US App Store, displacing OpenAI's ChatGPT. What truly rattled the industry was DeepSeek's claim that it developed its latest model, the R1, at a fraction of the cost major companies are currently investing in AI development, primarily on expensive Nvidia chips and software. This development is particularly significant given that the AI boom, ignited by ChatGPT's release in late 2022, has propelled Nvidia to become one of the world's most valuable companies. The news sent shockwaves through the US tech sector, exposing a critical concern: should tech giants continue pouring hundreds of billions into AI investment when a Chinese company can produce a comparable model so economically? DeepSeek was also a poke in the eye to Washington and its priority of thwarting China by maintaining American technological dominance, which has already led to legislation that could ban TikTok in the United States. On his first full day in office, Trump last week announced a major AI infrastructure project with OpenAI and Japan's SoftBank, emhpasizing the competition with China as a key motivator. Tech investor and Trump ally Marc Andreessen declared \"Deepseek R1 is AI's Sputnik moment,\" referencing the 1957 launch of Earth's first artificial satellite by the Soviet Union that stunned the Western world. The situation is particularly remarkable since, as a Chinese company, DeepSeek lacks access to Nvidia's state-of-the-art chips used to train AI models powering chatbots like ChatGPT. Exports of Nvidia's most powerful technology are blocked by order of the US government, given the strategic importance of developing AI. \"If China is catching up quickly to the US in the AI race, then the economics of AI will be turned on its head,\" warned Kathleen Brooks, research director at XTB, in a note to clients. Microsoft CEO Satya Nadella, visibly concerned, took to social media hours before markets opened to dismiss concerns about cheaply-produced AI, saying less expensive AI was good for everyone. But last week at the World Economic Forum in Davis, Nadella warned: \"We should take the developments out of China very, very seriously.\" Microsoft, an eager adopter of generative AI, plans to invest $80 billion in AI this year, while Meta announced at least $60 billion in investments on Friday. Much of those investments go into the coffers of Nvidia, whose shares plunged as much as a staggering 17 percent on Monday. Adding to the turmoil, the esteemed Stratechery tech newsletter and others suggested that DeepSeek's innovations stemmed from necessity, as lacking access to powerful Nvidia-designed chips forced them to develop novel methods. The blocks are \"driving startups like DeepSeek to innovate in ways that prioritize efficiency, resource-pooling, and collaboration,\" wrote the MIT Technology Review. Elon Musk, who has invested heavily in Nvidia chips for his xAI company's supercluster, suspects DeepSeek of secretly accessing banned H100 chips -- an accusation also made by the CEO of ScaleAI, a prominent Silicon Valley startup backed by Amazon and Meta. But such accusations \"sound like a rich kids team got outplayed by a poor kids team,\" wrote Hong Kong-based investor Jen Zhu Scott on X. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/291738017639-6/291738017639-6.jpg", "path": "full/ed914d465c875859dba3f258e32cdb49f8598353.jpg", "checksum": "a08b18a955eba29d6d94dd19ca639b13", "status": "downloaded"}]},
{"title": "Modi says spoke to Trump over phone", "detail_url": "https://tribune.com.pk/story/2524954/modi-says-spoke-to-trump-over-phone", "image_urls": ["https://i.tribune.com.pk/media/images/271738017639-4/271738017639-4.jpg"], "catagory": "Afp", "content": "Indian Prime Minister Narendra Modi and US President Donald Trump spoke in a phone call on Monday, Modi said in a post on X, the first conversation between the two leaders since Trump's inauguration last week. \"We are committed to a mutually beneficial and trusted partnership,\" Modi said in the post, adding that he also congratulated his \"dear friend\" on his historic second term in office. \"We will work together for the welfare of our people and towards global peace, prosperity, and security,\" Modi said. The United States is India's largest trading partner and two-way trade between the two countries surpassed $118 billion in 2023/24, with India posting a trade surplus of $32 billion. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/271738017639-4/271738017639-4.jpg", "path": "full/e400d2700898f7c3c39fdc1e9e2963e9a7a1b38a.jpg", "checksum": "733fc0064d2d9a37dba33e5499d56f4e", "status": "downloaded"}]},
{"title": "Gazans stream home to the north after deal", "detail_url": "https://tribune.com.pk/story/2524955/gazans-stream-home-to-the-north-after-deal", "image_urls": ["https://i.tribune.com.pk/media/images/261738017639-3/261738017639-3.jpg"], "catagory": "Afp", "content": "Masses of displaced Palestinians began streaming towards the north of the war-battered Gaza Strip on Monday after Israel and Hamas said they had reached a deal for the release of another six hostages. Also on Monday, the Israeli government said eight of the hostages held in Gaza who were due for release in the first phase of the truce are dead. The fragile ceasefire and hostage release deal between Israel and Hamas is intended to bring an end to the more than 15-month war that began with the October 7, 2023 Hamas attack on Israel. Israel had been preventing Palestinians from returning to their homes in northern Gaza, accusing Hamas of violating the terms of the truce, but Prime Minister Benjamin Netanyahu's office said late Sunday they would be allowed to pass after a new agreement was reached. Hamas had said blocking the returns amounted to a truce violation. Crowds began making their way north along a coastal road on foot Monday morning, carrying what belongings they could, AFPTV images showed. \"This is the happiest day of my life,\" said Lamees al-Iwady, a 22-year-old who returned to Gaza City on Monday after being displaced several times. \"I feel as though my soul and life have returned to me,\" she said. \"We will rebuild our homes, even if it's with mud and sand.\" A Gaza security official told AFP that \"more than 200,000 displaced people have returned to Gaza and North Gaza\" in the first two hours of the day. With the joy of return came the shock of the extent of the destruction wrought by more than a year of war. According to the Hamas-run government media office, 135,000 tents and caravans are needed in Gaza City and the north to shelter returning families. Still, Hamas called the return \"a victory\" for Palestinians that \"signals the failure and defeat of the plans for occupation and displacement\". The comments came after US President Donald Trump floated an idea to \"clean out\" Gaza and resettle Palestinians in Jordan and Egypt, drawing condemnation from regional leaders. President Mahmud Abbas, whose Palestinian Authority is based in the Israeli-occupied West Bank, issued a \"strong rejection and condemnation of any projects\" aimed at displacing Palestinians from Gaza, his office said. For Palestinians, any attempt to move them from Gaza would evoke dark memories of what the Arab world calls the \"Nakba\", or catastrophe -- the mass displacement of Palestinians during Israel's creation in 1948. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/261738017639-3/261738017639-3.jpg", "path": "full/90a8eb376815bb63b4a725b77a38694d5b347653.jpg", "checksum": "3abf598f29507a013a1aa7ba7706559c", "status": "downloaded"}]},
{"title": "Rajapaksa son issued travel ban", "detail_url": "https://tribune.com.pk/story/2524956/rajapaksa-son-issued-travel-ban", "image_urls": ["https://i.tribune.com.pk/media/images/251738017639-2/251738017639-2.jpg"], "catagory": "Afp", "content": "The son of Sri Lanka's former president Mahinda Rajapaksa was banned Monday from leaving the island nation following his arrest for alleged money laundering. The case against Yoshitha Rajapaksa dates back years, but has received renewed impetus since President Anura Kumara Dissanayake -- who has vowed to fight endemic corruption -- won a landslide election victory. Several members of the powerful Rajapaksa family and close associates have been charged with an array of offences over the years, including corruption and even murder -- all of which are still pending in the courts. A former junior naval officer, Yoshitha Rajapaksa, 36, was hit with the travel ban after police said he was unable to explain the sources of income used to purchase a home while his father was in power from 2005 to 2015. He was arrested and spent two days in detention before being released Monday by a magistrate in Colombo on a bond of 100 million rupees ($344,000). Yoshitha had told investigators that he raised money to buy the property by selling a small bag of gems his grand-aunt had given him. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/251738017639-2/251738017639-2.jpg", "path": "full/fcdfca4a95ffddbfef99408896aaadb68c425234.jpg", "checksum": "1be017a8401671ebee2351bdaad29b7d", "status": "downloaded"}]},
{"title": "Let bygones be bygones", "detail_url": "https://tribune.com.pk/story/2524958/let-bygones-be-bygones", "image_urls": ["https://i.tribune.com.pk/media/images/231738017638-0/231738017638-0.jpg"], "catagory": "Afp", "content": "As the world remembers Auschwitz, the German far right has pushed back against the country's tradition of Holocaust remembrance, now with backing from US tech billionaire Elon Musk. \"I think there's too much of a focus on past guilt and we need to move beyond that,\" the ally of US President Donald Trump told an Alternative for Germany (AfD) rally in a video discussion at the weekend. \"Children should not be guilty for the sins of their great grandparents,\" he told supporters of the AfD, an anti-immigration party he has strongly supported ahead of February 23 elections. Musk's comments flew in the face of those made by Chancellor Olaf Scholz to mark 80 years since the liberation of the extermination camp in what was Nazi-occupied Poland and on the \"civilisational rupture\" of the Holocaust. \"Every single person in our country bears responsibility, regardless of their own family history, regardless of the religion or birthplace of their parents or grandparents,\" Scholz said in a speech. Musk's comments were all the more divisive as they came ahead of Monday's 80th anniversary of the liberation of Auschwitz, where more than one million Jewish people and over 100,000 others died between 1940 and 1945. Polish Prime Minister Donald Tusk, whose country is hosting commemorations, was quick to criticise slogans made at Saturday's rally, although he did not mention Musk by name. \"The words we heard from the main actors of the AfD rally about 'Great Germany' and 'the need to forget German guilt for Nazi crimes' sounded all too familiar and ominous,\" the Polish leader wrote on X. \"Especially only hours before the anniversary of the liberation of Auschwitz\". Scholz, who went to Poland for the anniversary events, responded to Tusk's message: \"I couldn't agree more, dear Donald.\" COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/231738017638-0/231738017638-0.jpg", "path": "full/f3ef77d9ad59a4c94a799c010cf6676a1960d12e.jpg", "checksum": "10e17070fd41d0701ecb25aedb17d32f", "status": "downloaded"}]},
{"title": "Afghans complain of rising food prices", "detail_url": "https://tribune.com.pk/story/2524957/afghans-complain-of-rising-food-prices", "image_urls": ["https://i.tribune.com.pk/media/images/241738017639-1/241738017639-1.jpg"], "catagory": "Afp", "content": "Residents of the Afghan capital have complained of rising food prices as the local currency lost value against the US dollar in recent days. The currency fell to around 80 Afghanis to the dollar on Monday after hovering around 70 in recent weeks. Kabul residents have reported rising prices of basic goods and are concerned they will not readjust in one of the poorest countries in the world, where consumers are anxiously following policy announcements from US President Donald Trump's new administration. Observers link the change to Trump's decision to freeze US foreign assistance. The United States remains Afghanistan's largest aid donor. Afghanistan's currency stability in part depends on US dollars flowing in to aid organisations that are then exchanged in the market for Afghani, analysts said. The fear is that \"this dollar is not going to come anymore. So the Afghani does not have takers\", said analyst Torek Farhadi, who was an adviser on the development of the Afghani in the years after the end of the first Taliban reign in 2001. For Abdul Maroof Niaz Zada, a 40-year-old Kabul shopkeeper, the fluctuation \"may mean nothing to the rest of the world, but it has a big impact in Afghanistan\". \"The price changes are not noticeable for the businessmen maybe but it's very difficult for the poor,\" he said, noting that the prices of daily goods such as flour, oil and rice had gone up by 200-500 Afghanis ($2.60 - $6.70). The World Food Programme said in January nearly 15 million people are going hungry across Afghanistan, with the UN agency providing aid to help people get through the country's harsh winters. \"Food, fuel, gas, everything gets expensive as the dollar goes up,\" 28-year-old Tofan Ahmadi, who works at a Kabul currency exchange, told AFP. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/241738017639-1/241738017639-1.jpg", "path": "full/93c8c2f229c7413a198464101296fe68bfc31cd7.jpg", "checksum": "3fec42ef1b8f78cb06b70448f3f4eb40", "status": "downloaded"}]},
{"title": "Imran's acquittal plea in GHQ attack case rejected", "detail_url": "https://tribune.com.pk/story/2524959/imrans-acquittal-plea-in-ghq-attack-case-rejected", "image_urls": ["https://i.tribune.com.pk/media/images/Untitled-design-(5)1724319076-0/Untitled-design-(5)1724319076-0.jpg"], "catagory": "​ Our Correspondents", "content": "The Anti-Terrorism Court (ATC) Rawalpindi has rejected the acquittal pleas of Pakistan Tehreek-e-Insaf (PTI) founder Imran Khan and two PTI leaders in GHQ attack case. During the hearing of the pleas filed by PTI founder Imran Khan as well as PTI leaders Ajmal Sabir and Sohail Irfan Abbasi in the court of Justice Amjad Ali Shah, Prosecutor Zaheer Shah argued that the trail in the case was underway with recording of the 12 witnesses, adding it is not the right time to hear the acquittal plea. He prayed the court to provide the prosecution an opportunity to get the witnesses statements recorded. The judge was convinced by the prosecution's arguments, and he dismissed all the three acquittal pleas. Earlier, the court had also dismissed the acquittal plea of Sheikh Rashid Ahmed in GHQ attack case while the high court also upheld the trial court verdict. Meanwhile, Islamabad High Court (IHC) Chief Justice Aamir Farooq has summoned the Adiala Jail superintendent in a plea filed by PTI founder Imran Khan seeking facilitation for his telephonic contact with his sons, medical check-up from personal physician and provision of facilities in prison. Imran Khan's lawyer Faisal Fareed Chaudhry and the jail officials appeared before the court. The chief justice remarked that the court had solicited from the jail officials the details on phone calls and meetings. The jail officials replied that Imran Khan made a phone call to his sons on January 13. The CJ remarked that he would not have to submit a request for the phone call every now and then. The jail officials submitted that the WhatsApp calls are not allowed as per rules but Imran's contact with his sons via WhatsApp was made over the court order. They also told the court that Imran's meetings with his wife Busha Bibi were facilitated twice after his conviction. Besides, the couple also met on January 17, 20 and 23 during the trial. The IHC chief justice remarked that someone ran into during the hearing was not regarded as a meeting. The court admonished the jail officials and directed the Adiala Jail superintendent to appear before the court with detailed answers on Tuesday (today). The judge also directed the jailer to come after reading the court order of January 23. In addition, PTI founder Imran Khan and his spouse Bushra Bibi have filed appeals in IHC against their conviction in 190 million pounds reference. The petitioners requested the court to set aside the ATC verdict and order to release them on bail till the conclusion of the appeals. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/Untitled-design-(5)1724319076-0/Untitled-design-(5)1724319076-0.jpg", "path": "full/550df040119b63efcb30255de8aa04d7ae6ef594.jpg", "checksum": "dcd4976c04acf99a59c302bebd9c5d3f", "status": "downloaded"}]},
{"title": "Rs825m tax evasion detected at Port Qasim", "detail_url": "https://tribune.com.pk/story/2524960/rs825m-tax-evasion-detected-at-port-qasim", "image_urls": ["https://i.tribune.com.pk/media/images/401738018534-10/401738018534-10.jpg"], "catagory": "Ehtesham Mufti", "content": "The Collectorate of Customs (Exports) at Port Muhammad Bin Qasim has uncovered tax and duty evasion amounting to Rs825 million and filed a case against a trading unit operating within the Export Processing Zone (EPZ). The collectorate audited consignments imported by M/s Sardar Enterprises during the fiscal year 2023-24, based on credible information regarding the unit's activities. The audit revealed that the company misused the exemptions granted to EPZ units, engaging in smuggling and tax evasion. In January this year, the company imported two consignments, one of which raised alarms during a detailed examination. The company had falsely declared a consignment as comprising mixed old and used LCD laptops, LCD panels, computer parts and components. However, upon inspection, the Customs audit team found used tablets and new keyboards, which are not permissible under EPZ import regulations. In the second consignment, the company declared bales of cotton in the goods declaration. However, a Customs examination revealed that 14,000 kilograms of cellulose acetate tow were concealed inside the cotton bales, which violates EPZ import laws. Through these misdeclarations, M/s Sardar Enterprises evaded Rs825 million in duties and taxes, causing a loss to the national exchequer. The collectorate has registered a case against the company's directors, Javed Rasheed and Waqar Insha, as well as clearing agent M/s Maryam Logistics' owner Ahmed Shehzad Khan and Qurban Ali. Two teams have been formed to arrest the suspects. COMMENTS  Comments are moderated and generally will be posted if they are on-topic and not abusive.  For more information, please see our", "publication_date": "January 28, 2025", "images": [{"url": "https://i.tribune.com.pk/media/images/401738018534-10/401738018534-10.jpg", "path": "full/be582e4b9993e6ae65a21ebe4580e4f571677578.jpg", "checksum": "d3b70f742f64fa5d059c753adce9445f", "status": "downloaded"}]}
]